// Class Engine.BlueprintFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBlueprintFunctionLibrary : UObject {
};

// Class Engine.ActorComponent
// Size: 0xb0 (Inherited: 0x28)
struct UActorComponent : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FActorComponentTickFunction PrimaryComponentTick; // 0x30(0x30)
	struct TArray<struct FName> ComponentTags; // 0x60(0x10)
	struct TArray<struct UAssetUserData*> AssetUserData; // 0x70(0x10)
	char pad_80[0x4]; // 0x80(0x04)
	int32_t UCSSerializationIndex; // 0x84(0x04)
	char pad_88_0 : 3; // 0x88(0x01)
	char bNetAddressable : 1; // 0x88(0x01)
	char bReplicates : 1; // 0x88(0x01)
	char pad_88_5 : 3; // 0x88(0x01)
	char pad_89_0 : 7; // 0x89(0x01)
	char bAutoActivate : 1; // 0x89(0x01)
	char bIsActive : 1; // 0x8a(0x01)
	char bEditableWhenInherited : 1; // 0x8a(0x01)
	char pad_8A_2 : 1; // 0x8a(0x01)
	char bCanEverAffectNavigation : 1; // 0x8a(0x01)
	char pad_8A_4 : 1; // 0x8a(0x01)
	char bIsEditorOnly : 1; // 0x8a(0x01)
	char pad_8A_6 : 2; // 0x8a(0x01)
	char pad_8B[0x1]; // 0x8b(0x01)
	enum class EComponentCreationMethod CreationMethod; // 0x8c(0x01)
	struct FMulticastSparseDelegate OnComponentActivated; // 0x8d(0x01)
	struct FMulticastSparseDelegate OnComponentDeactivated; // 0x8e(0x01)
	char pad_8F[0x1]; // 0x8f(0x01)
	struct TArray<struct FSimpleMemberReference> UCSModifiedProperties; // 0x90(0x10)
	char pad_A0[0x10]; // 0xa0(0x10)

	void ToggleActive(); // Function Engine.ActorComponent.ToggleActive // (NetReliableNetRequest|Exec|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetServer|HasOutParms|HasDefaults|NetClient|DLLImport|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.ActorComponent.SetTickGroup // (Exec|Native|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.ActorComponent.SetTickableWhenPaused // (NetReliableExec|Native|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void SetIsReplicated(bool ShouldReplicate); // Function Engine.ActorComponent.SetIsReplicated // (NetReliableNetRequest|Native|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void SetComponentTickInterval(float TickInterval); // Function Engine.ActorComponent.SetComponentTickInterval // (NetRequest|Native|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void SetComponentTickEnabled(bool bEnabled); // Function Engine.ActorComponent.SetComponentTickEnabled // (NetReliableNative|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void SetAutoActivate(bool bNewAutoActivate); // Function Engine.ActorComponent.SetAutoActivate // (Net|NetReliableNetRequest|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void SetActive(bool bNewActive, bool bReset); // Function Engine.ActorComponent.SetActive // (Net|NetReliableNetRequest|Exec|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.RemoveTickPrerequisiteComponent // (NetRequest|Exec|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.RemoveTickPrerequisiteActor // (NetReliableExec|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void ReceiveTick(float DeltaSeconds); // Function Engine.ActorComponent.ReceiveTick // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.ActorComponent.ReceiveEndPlay // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void ReceiveBeginPlay(); // Function Engine.ActorComponent.ReceiveBeginPlay // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void OnRep_IsActive(); // Function Engine.ActorComponent.OnRep_IsActive // (Net|Exec|Native|Event|Static|NetMulticast|MulticastDelegate|Public|Private|Protected|Delegate|NetServer|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void K2_DestroyComponent(struct UObject* Object); // Function Engine.ActorComponent.K2_DestroyComponent // (NetReliableNetRequest|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	bool IsComponentTickEnabled(); // Function Engine.ActorComponent.IsComponentTickEnabled // (Net|NetRequest|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	bool IsBeingDestroyed(); // Function Engine.ActorComponent.IsBeingDestroyed // (Net|NetRequest|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	bool IsActive(); // Function Engine.ActorComponent.IsActive // (NetRequest|Event|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	struct AActor* GetOwner(); // Function Engine.ActorComponent.GetOwner // (Net|NetReliableEvent|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	float GetComponentTickInterval(); // Function Engine.ActorComponent.GetComponentTickInterval // (Net|NetReliableEvent|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void Deactivate(); // Function Engine.ActorComponent.Deactivate // (NetReliableNetRequest|Exec|Native|Event|Private|Protected|HasOutParms|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	bool ComponentHasTag(struct FName Tag); // Function Engine.ActorComponent.ComponentHasTag // (NetReliableExec|Native|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.ActorComponent.AddTickPrerequisiteComponent // (Net|NetRequest|Native|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.ActorComponent.AddTickPrerequisiteActor // (Net|NetReliableNative|NetResponse|Static|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
	void Activate(bool bReset); // Function Engine.ActorComponent.Activate // (NetReliableEvent|Static|UbergraphFunction|MulticastDelegate|Public|Private|Protected|HasDefaults|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b140
};

// Class Engine.SceneComponent
// Size: 0x320 (Inherited: 0xb0)
struct USceneComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct TWeakObjectPtr<struct APhysicsVolume> PhysicsVolume; // 0xb8(0x08)
	struct USceneComponent* AttachParent; // 0xc0(0x08)
	struct FName AttachSocketName; // 0xc8(0x08)
	struct TArray<struct USceneComponent*> AttachChildren; // 0xd0(0x10)
	struct TArray<struct USceneComponent*> ClientAttachedChildren; // 0xe0(0x10)
	char pad_F0[0x2c]; // 0xf0(0x2c)
	struct FVector RelativeLocation; // 0x11c(0x0c)
	struct FRotator RelativeRotation; // 0x128(0x0c)
	struct FVector RelativeScale3D; // 0x134(0x0c)
	struct FVector ComponentVelocity; // 0x140(0x0c)
	char bComponentToWorldUpdated : 1; // 0x14c(0x01)
	char pad_14C_1 : 1; // 0x14c(0x01)
	char bAbsoluteLocation : 1; // 0x14c(0x01)
	char bAbsoluteRotation : 1; // 0x14c(0x01)
	char bAbsoluteScale : 1; // 0x14c(0x01)
	char bVisible : 1; // 0x14c(0x01)
	char bShouldBeAttached : 1; // 0x14c(0x01)
	char bShouldSnapLocationWhenAttached : 1; // 0x14c(0x01)
	char bShouldSnapRotationWhenAttached : 1; // 0x14d(0x01)
	char bShouldUpdatePhysicsVolume : 1; // 0x14d(0x01)
	char bHiddenInGame : 1; // 0x14d(0x01)
	char bBoundsChangeTriggersStreamingDataRebuild : 1; // 0x14d(0x01)
	char bUseAttachParentBound : 1; // 0x14d(0x01)
	char bDisableUpdateComponentToWorldIfNotVisiable : 1; // 0x14d(0x01)
	char bDisableUpdateComponentToWorldIfTickStateCoolingDown : 1; // 0x14d(0x01)
	char bDisableDeferredUpdateComponent : 1; // 0x14d(0x01)
	char pad_14E[0x1]; // 0x14e(0x01)
	enum class EComponentMobility Mobility; // 0x14f(0x01)
	enum class EDetailMode DetailMode; // 0x150(0x01)
	struct FMulticastSparseDelegate PhysicsVolumeChangedDelegate; // 0x151(0x01)
	char pad_152[0x1ce]; // 0x152(0x1ce)

	void ToggleVisibility(bool bPropagateToChildren); // Function Engine.SceneComponent.ToggleVisibility // (Net|Exec|Native|Static|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	bool SnapTo(struct USceneComponent* InParent, struct FName InSocketName); // Function Engine.SceneComponent.SnapTo // (NetReliableNetRequest|Native|Static|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void SetWorldScale3D(struct FVector NewScale); // Function Engine.SceneComponent.SetWorldScale3D // (Net|NetReliableNetRequest|Exec|Static|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void SetVisibilityByFlag(bool bNewVisibility, int32_t Flag, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibilityByFlag // (NetReliableExec|Static|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void SetVisibility(bool bNewVisibility, bool bPropagateToChildren); // Function Engine.SceneComponent.SetVisibility // (Net|NetReliableNetRequest|Static|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void SetShouldUpdatePhysicsVolume(bool bInShouldUpdatePhysicsVolume); // Function Engine.SceneComponent.SetShouldUpdatePhysicsVolume // (Net|NetRequest|Static|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void SetRelativeScale3D(struct FVector NewScale3D); // Function Engine.SceneComponent.SetRelativeScale3D // (Net|NetReliableStatic|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void SetMobility(enum class EComponentMobility NewMobility); // Function Engine.SceneComponent.SetMobility // (Net|Static|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void SetHiddenInGame(bool NewHidden, bool bPropagateToChildren); // Function Engine.SceneComponent.SetHiddenInGame // (Net|NetRequest|Exec|Native|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void SetAbsolute(bool bNewAbsoluteLocation, bool bNewAbsoluteRotation, bool bNewAbsoluteScale); // Function Engine.SceneComponent.SetAbsolute // (Net|NetReliableNetRequest|Native|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void ResetRelativeTransform(); // Function Engine.SceneComponent.ResetRelativeTransform // (NetReliableNetRequest|Native|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void OnRep_Visibility(bool OldValue); // Function Engine.SceneComponent.OnRep_Visibility // (Net|NetReliableNetRequest|Exec|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void OnRep_Transform(); // Function Engine.SceneComponent.OnRep_Transform // (NetReliableNetRequest|Exec|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void OnRep_AttachSocketName(); // Function Engine.SceneComponent.OnRep_AttachSocketName // (NetReliableNetRequest|Exec|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void OnRep_AttachParent(); // Function Engine.SceneComponent.OnRep_AttachParent // (NetReliableNetRequest|Exec|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void OnRep_AttachChildren(); // Function Engine.SceneComponent.OnRep_AttachChildren // (Net|NetRequest|Exec|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetWorldTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldTransform // (Net|NetRequest|Event|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetWorldRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldRotation // (Net|NetReliableNetRequest|Exec|Native|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetWorldLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocationAndRotation // (Net|NetReliableNetRequest|Native|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetWorldLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetWorldLocation // (Net|Native|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetRelativeTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeTransform // (Net|Exec|NetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetRelativeRotation(struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeRotation // (NetReliableNetResponse|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetRelativeLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocationAndRotation // (NetReliableExec|Native|Event|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_SetRelativeLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_SetRelativeLocation // (NetRequest|Native|Event|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FTransform K2_GetComponentToWorld(); // Function Engine.SceneComponent.K2_GetComponentToWorld // (NetReliableNative|Event|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FVector K2_GetComponentScale(); // Function Engine.SceneComponent.K2_GetComponentScale // (Net|Native|Event|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FRotator K2_GetComponentRotation(); // Function Engine.SceneComponent.K2_GetComponentRotation // (Native|Event|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FVector K2_GetComponentLocation(); // Function Engine.SceneComponent.K2_GetComponentLocation // (Net|NetReliableNetRequest|Exec|Event|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_DetachFromComponent(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule, bool bCallModify); // Function Engine.SceneComponent.K2_DetachFromComponent // (NetReliableExec|Event|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	bool K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachToComponent // (Net|NetReliableEvent|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	bool K2_AttachTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachType, bool bWeldSimulatedBodies); // Function Engine.SceneComponent.K2_AttachTo // (NetReliableNetRequest|Exec|Native|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldTransform // (NetReliableNetRequest|Native|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldRotation // (Native|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddWorldOffset // (Net|Exec|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddRelativeRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeRotation // (Net|NetReliablePrivate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddRelativeLocation(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddRelativeLocation // (NetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddLocalTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalTransform // (NetRequest|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalRotation // (NetReliableNetRequest|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void K2_AddLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.SceneComponent.K2_AddLocalOffset // (Net|NetReliableNetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	bool IsVisible(); // Function Engine.SceneComponent.IsVisible // (NetReliableNetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	bool IsSimulatingPhysics(struct FName BoneName); // Function Engine.SceneComponent.IsSimulatingPhysics // (NetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	bool IsAnySimulatingPhysics(); // Function Engine.SceneComponent.IsAnySimulatingPhysics // (Net|Exec|Event|Static|Public|Delegate|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FVector GetUpVector(); // Function Engine.SceneComponent.GetUpVector // (NetReliableNetRequest|Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FTransform GetSocketTransform(struct FName InSocketName, enum class ERelativeTransformSpace TransformSpace, bool bDoParallel); // Function Engine.SceneComponent.GetSocketTransform // (Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	struct FRotator GetSocketRotation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketRotation // (NetReliableNetRequest|Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FQuat GetSocketQuaternion(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketQuaternion // (Net|NetReliableNative|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FVector GetSocketLocation(struct FName InSocketName); // Function Engine.SceneComponent.GetSocketLocation // (Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	bool GetShouldUpdatePhysicsVolume(); // Function Engine.SceneComponent.GetShouldUpdatePhysicsVolume // (Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FVector GetRightVector(); // Function Engine.SceneComponent.GetRightVector // (Net|NetReliableNetRequest|Exec|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FTransform GetRelativeTransform(); // Function Engine.SceneComponent.GetRelativeTransform // (Net|NetRequest|Exec|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct APhysicsVolume* GetPhysicsVolume(); // Function Engine.SceneComponent.GetPhysicsVolume // (NetRequest|Exec|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void GetParentComponents(struct TArray<struct USceneComponent*>& Parents); // Function Engine.SceneComponent.GetParentComponents // (NetReliableExec|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	int32_t GetNumChildrenComponents(); // Function Engine.SceneComponent.GetNumChildrenComponents // (Net|Exec|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FVector GetForwardVector(); // Function Engine.SceneComponent.GetForwardVector // (Native|NetMulticast|UbergraphFunction|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FVector GetComponentVelocity(); // Function Engine.SceneComponent.GetComponentVelocity // (Exec|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void GetChildrenComponents(bool bIncludeAllDescendants, struct TArray<struct USceneComponent*>& Children); // Function Engine.SceneComponent.GetChildrenComponents // (NetRequest|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct USceneComponent* GetChildComponent(int32_t ChildIndex); // Function Engine.SceneComponent.GetChildComponent // (NetReliableNetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct FName GetAttachSocketName(); // Function Engine.SceneComponent.GetAttachSocketName // (Net|NetRequest|Native|NetResponse|Static|MulticastDelegate|Private|NetServer|HasDefaults|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct USceneComponent* GetAttachParent(); // Function Engine.SceneComponent.GetAttachParent // (Net|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	struct TArray<struct FName> GetAllSocketNames(); // Function Engine.SceneComponent.GetAllSocketNames // (Net|NetReliableNetRequest|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	bool DoesSocketExist(struct FName InSocketName); // Function Engine.SceneComponent.DoesSocketExist // (Net|NetRequest|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
	void DetachFromParent(bool bMaintainWorldPosition, bool bCallModify); // Function Engine.SceneComponent.DetachFromParent // (Net|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b380
};

// Class Engine.PrimitiveComponent
// Size: 0x540 (Inherited: 0x320)
struct UPrimitiveComponent : USceneComponent {
	float MinDrawDistance; // 0x320(0x04)
	float LDMaxDrawDistance; // 0x324(0x04)
	float CachedMaxDrawDistance; // 0x328(0x04)
	float MinScreenSizeCulling; // 0x32c(0x04)
	enum class ESceneDepthPriorityGroup DepthPriorityGroup; // 0x330(0x01)
	enum class ESceneDepthPriorityGroup ViewOwnerDepthPriorityGroup; // 0x331(0x01)
	enum class EIndirectLightingCacheQuality IndirectLightingCacheQuality; // 0x332(0x01)
	enum class ELightmapType LightmapType; // 0x333(0x01)
	char bUseMaxLODAsImposter : 1; // 0x334(0x01)
	char bBatchImpostersAsInstances : 1; // 0x334(0x01)
	char bNeverDistanceCull : 1; // 0x334(0x01)
	char pad_334_3 : 4; // 0x334(0x01)
	char bAlwaysCreatePhysicsState : 1; // 0x334(0x01)
	char bGenerateOverlapEvents : 1; // 0x335(0x01)
	char bMultiBodyOverlap : 1; // 0x335(0x01)
	char bTraceComplexOnMove : 1; // 0x335(0x01)
	char bReturnMaterialOnMove : 1; // 0x335(0x01)
	char bUseViewOwnerDepthPriorityGroup : 1; // 0x335(0x01)
	char bAllowCullDistanceVolume : 1; // 0x335(0x01)
	char bHasMotionBlurVelocityMeshes : 1; // 0x335(0x01)
	char bVisibleInReflectionCaptures : 1; // 0x335(0x01)
	char bVisibleInRayTracing : 1; // 0x336(0x01)
	char bRenderInMainPass : 1; // 0x336(0x01)
	char bRenderInDepthPass : 1; // 0x336(0x01)
	char bReceivesDecals : 1; // 0x336(0x01)
	char bOwnerNoSee : 1; // 0x336(0x01)
	char bOnlyOwnerSee : 1; // 0x336(0x01)
	char bTreatAsBackgroundForOcclusion : 1; // 0x336(0x01)
	char bUseAsOccluder : 1; // 0x336(0x01)
	char bIgnoreOcclusionCull : 1; // 0x337(0x01)
	char bSelectable : 1; // 0x337(0x01)
	char bForceMipStreaming : 1; // 0x337(0x01)
	char bHasPerInstanceHitProxies : 1; // 0x337(0x01)
	char CastShadow : 1; // 0x337(0x01)
	char bAffectDynamicIndirectLighting : 1; // 0x337(0x01)
	char bAffectDistanceFieldLighting : 1; // 0x337(0x01)
	char bCastDynamicShadow : 1; // 0x337(0x01)
	char bCastStaticShadow : 1; // 0x338(0x01)
	char bCastVolumetricTranslucentShadow : 1; // 0x338(0x01)
	char bSelfShadowOnly : 1; // 0x338(0x01)
	char bForceGenLightmap : 1; // 0x338(0x01)
	char bCastFarShadow : 1; // 0x338(0x01)
	char bCastInsetShadow : 1; // 0x338(0x01)
	char bCastCinematicShadow : 1; // 0x338(0x01)
	char bCastHiddenShadow : 1; // 0x338(0x01)
	char bCastShadowAsTwoSided : 1; // 0x339(0x01)
	char bLightAsIfStatic : 1; // 0x339(0x01)
	char bLightAttachmentsAsGroup : 1; // 0x339(0x01)
	char bExcludeFromLightAttachmentGroup : 1; // 0x339(0x01)
	char bReceiveMobileCSMShadows : 1; // 0x339(0x01)
	char bSingleSampleShadowFromStationaryLights : 1; // 0x339(0x01)
	char bIgnoreRadialImpulse : 1; // 0x339(0x01)
	char bIgnoreRadialForce : 1; // 0x339(0x01)
	char bApplyImpulseOnDamage : 1; // 0x33a(0x01)
	char bReplicatePhysicsToAutonomousProxy : 1; // 0x33a(0x01)
	char bFillCollisionUnderneathForNavmesh : 1; // 0x33a(0x01)
	char AlwaysLoadOnClient : 1; // 0x33a(0x01)
	char AlwaysLoadOnServer : 1; // 0x33a(0x01)
	char bUseEditorCompositing : 1; // 0x33a(0x01)
	char bRenderCustomDepth : 1; // 0x33a(0x01)
	char bRenderMainPassStencil : 1; // 0x33a(0x01)
	char pad_33B[0x1]; // 0x33b(0x01)
	enum class EHasCustomNavigableGeometry bHasCustomNavigableGeometry; // 0x33c(0x01)
	char pad_33D[0x1]; // 0x33d(0x01)
	enum class ECanBeCharacterBase CanCharacterStepUpOn; // 0x33e(0x01)
	struct FLightingChannels LightingChannels; // 0x33f(0x01)
	enum class ERendererStencilMask CustomDepthStencilWriteMask; // 0x340(0x01)
	char pad_341[0x3]; // 0x341(0x03)
	int32_t CustomDepthStencilValue; // 0x344(0x04)
	int32_t MainPassDepthStencilValue; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct FCustomPrimitiveData CustomPrimitiveData; // 0x350(0x10)
	struct FCustomPrimitiveData CustomPrimitiveDataInternal; // 0x360(0x10)
	int32_t TranslucencySortPriority; // 0x370(0x04)
	int32_t VisibilityId; // 0x374(0x04)
	struct TArray<struct URuntimeVirtualTexture*> RuntimeVirtualTextures; // 0x378(0x10)
	int8_t VirtualTextureLodBias; // 0x388(0x01)
	int8_t VirtualTextureCullMips; // 0x389(0x01)
	int8_t VirtualTextureMinCoverage; // 0x38a(0x01)
	enum class ERuntimeVirtualTextureMainPassType VirtualTextureRenderPassType; // 0x38b(0x01)
	char pad_38C[0x4]; // 0x38c(0x04)
	float LpvBiasMultiplier; // 0x390(0x04)
	char pad_394[0x8]; // 0x394(0x08)
	float BoundsScale; // 0x39c(0x04)
	char pad_3A0[0x10]; // 0x3a0(0x10)
	struct TArray<struct AActor*> MoveIgnoreActors; // 0x3b0(0x10)
	struct TArray<struct UPrimitiveComponent*> MoveIgnoreComponents; // 0x3c0(0x10)
	char pad_3D0[0x10]; // 0x3d0(0x10)
	struct FBodyInstance BodyInstance; // 0x3e0(0x130)
	struct FMulticastSparseDelegate OnComponentHit; // 0x510(0x01)
	struct FMulticastSparseDelegate OnComponentBeginOverlap; // 0x511(0x01)
	struct FMulticastSparseDelegate OnComponentEndOverlap; // 0x512(0x01)
	struct FMulticastSparseDelegate OnComponentWake; // 0x513(0x01)
	struct FMulticastSparseDelegate OnComponentSleep; // 0x514(0x01)
	char pad_515[0x1]; // 0x515(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x516(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x517(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x518(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x519(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x51a(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x51b(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x51c(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x51d(0x01)
	char pad_51E[0x1a]; // 0x51e(0x1a)
	struct UPrimitiveComponent* LODParentPrimitive; // 0x538(0x08)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.PrimitiveComponent.WasRecentlyRendered // (NetReliableNetResponse|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void WakeRigidBody(struct FName BoneName); // Function Engine.PrimitiveComponent.WakeRigidBody // (Net|NetReliableNetRequest|Exec|Native|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void WakeAllRigidBodies(); // Function Engine.PrimitiveComponent.WakeAllRigidBodies // (Native|Static|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetWalkableSlopeOverride(struct FWalkableSlopeOverride& NewOverride); // Function Engine.PrimitiveComponent.SetWalkableSlopeOverride // (Net|NetRequest|Exec|Native|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetUseCCD(bool InUseCCD, struct FName BoneName); // Function Engine.PrimitiveComponent.SetUseCCD // (Net|Exec|Native|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetTranslucentSortPriority(int32_t NewTranslucentSortPriority); // Function Engine.PrimitiveComponent.SetTranslucentSortPriority // (Net|NetReliableNetRequest|Native|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetSingleSampleShadowFromStationaryLights(bool bNewSingleSampleShadowFromStationaryLights); // Function Engine.PrimitiveComponent.SetSingleSampleShadowFromStationaryLights // (Net|NetReliableNetRequest|Exec|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetSimulatePhysics(bool bSimulate); // Function Engine.PrimitiveComponent.SetSimulatePhysics // (Net|NetRequest|Exec|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetRenderMainPassStencil(bool bValue); // Function Engine.PrimitiveComponent.SetRenderMainPassStencil // (Net|NetReliableExec|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetRenderInMainPass(bool bValue); // Function Engine.PrimitiveComponent.SetRenderInMainPass // (Exec|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetRenderCustomDepth(bool bValue); // Function Engine.PrimitiveComponent.SetRenderCustomDepth // (NetReliableNetRequest|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetReceivesDecals(bool bNewReceivesDecals); // Function Engine.PrimitiveComponent.SetReceivesDecals // (NetRequest|Event|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysMaterialOverride(struct UPhysicalMaterial* NewPhysMaterial); // Function Engine.PrimitiveComponent.SetPhysMaterialOverride // (Net|Exec|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysicsMaxAngularVelocityInRadians(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInRadians // (NetReliableNetRequest|Exec|Native|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysicsMaxAngularVelocityInDegrees(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocityInDegrees // (Net|Exec|Native|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysicsMaxAngularVelocity(float NewMaxAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsMaxAngularVelocity // (Net|Exec|Native|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsLinearVelocity // (Net|NetRequest|Native|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysicsAngularVelocityInRadians(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInRadians // (Native|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysicsAngularVelocityInDegrees(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocityInDegrees // (Net|NetReliableExec|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetPhysicsAngularVelocity(struct FVector NewAngVel, bool bAddToCurrent, struct FName BoneName); // Function Engine.PrimitiveComponent.SetPhysicsAngularVelocity // (Net|NetReliableExec|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetOwnerNoSee(bool bNewOwnerNoSee); // Function Engine.PrimitiveComponent.SetOwnerNoSee // (Net|NetReliableNetRequest|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetOnlyOwnerSee(bool bNewOnlyOwnerSee); // Function Engine.PrimitiveComponent.SetOnlyOwnerSee // (Net|NetRequest|NetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision); // Function Engine.PrimitiveComponent.SetNotifyRigidBodyCollision // (NetReliableNetMulticast|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetMaterialByName(struct FName MaterialSlotName, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterialByName // (Net|NetRequest|Exec|Native|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetMaterial(int32_t ElementIndex, struct UMaterialInterface* Material); // Function Engine.PrimitiveComponent.SetMaterial // (NetReliableExec|Native|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetMassScale(struct FName BoneName, float InMassScale); // Function Engine.PrimitiveComponent.SetMassScale // (Net|NetReliableNetRequest|Native|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetMassOverrideInKg(struct FName BoneName, float MassInKg, bool bOverrideMass); // Function Engine.PrimitiveComponent.SetMassOverrideInKg // (Net|NetReliableNative|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetMainPassStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetMainPassStencilValue // (Net|Native|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetLinearDamping(float InDamping); // Function Engine.PrimitiveComponent.SetLinearDamping // (Exec|Event|NetResponse|NetMulticast|MulticastDelegate|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetLightingChannels(bool bChannel0, bool bChannel1, bool bChannel2); // Function Engine.PrimitiveComponent.SetLightingChannels // (NetRequest|Exec|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetLightAttachmentsAsGroup(bool bInLightAttachmentsAsGroup); // Function Engine.PrimitiveComponent.SetLightAttachmentsAsGroup // (NetReliableNetRequest|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetGenerateOverlapEvents(bool bInGenerateOverlapEvents); // Function Engine.PrimitiveComponent.SetGenerateOverlapEvents // (NetRequest|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetExcludeFromLightAttachmentGroup(bool bInExcludeFromLightAttachmentGroup); // Function Engine.PrimitiveComponent.SetExcludeFromLightAttachmentGroup // (Net|Event|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetEnableGravity(bool bGravityEnabled); // Function Engine.PrimitiveComponent.SetEnableGravity // (Net|NetReliableNetRequest|Exec|Native|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCustomPrimitiveDataVector4(int32_t DataIndex, struct FVector4 Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector4 // (NetRequest|Exec|Native|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCustomPrimitiveDataVector3(int32_t DataIndex, struct FVector Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector3 // (Net|Exec|Native|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCustomPrimitiveDataVector2(int32_t DataIndex, struct FVector2D Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataVector2 // (NetReliableNetRequest|Native|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCustomPrimitiveDataFloat(int32_t DataIndex, float Value); // Function Engine.PrimitiveComponent.SetCustomPrimitiveDataFloat // (NetReliableNative|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCustomDepthStencilWriteMask(enum class ERendererStencilMask WriteMaskBit); // Function Engine.PrimitiveComponent.SetCustomDepthStencilWriteMask // (Native|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCustomDepthStencilValue(int32_t Value); // Function Engine.PrimitiveComponent.SetCustomDepthStencilValue // (NetReliableNetRequest|Exec|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCullDistance(float NewCullDistance); // Function Engine.PrimitiveComponent.SetCullDistance // (NetRequest|Exec|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetConstraintMode(enum class EDOFMode ConstraintMode); // Function Engine.PrimitiveComponent.SetConstraintMode // (NetReliableExec|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCollisionResponseToChannel(enum class ECollisionChannel Channel, enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToChannel // (Net|NetReliableNetRequest|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCollisionResponseToAllChannels(enum class ECollisionResponse NewResponse); // Function Engine.PrimitiveComponent.SetCollisionResponseToAllChannels // (Net|NetRequest|NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCollisionProfileName(struct FName InCollisionProfileName, bool bUpdateOverlaps); // Function Engine.PrimitiveComponent.SetCollisionProfileName // (NetReliableNetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCollisionObjectType(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.SetCollisionObjectType // (NetResponse|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCollisionEnabled(enum class ECollisionEnabled NewType); // Function Engine.PrimitiveComponent.SetCollisionEnabled // (NetReliableNetRequest|Exec|Native|Event|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCenterOfMass(struct FVector CenterOfMassOffset, struct FName BoneName); // Function Engine.PrimitiveComponent.SetCenterOfMass // (Net|NetReliableExec|Native|Event|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCastShadow(bool NewCastShadow); // Function Engine.PrimitiveComponent.SetCastShadow // (Net|Exec|Native|Event|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetCastInsetShadow(bool bInCastInsetShadow); // Function Engine.PrimitiveComponent.SetCastInsetShadow // (NetReliableNetRequest|Native|Event|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetBoundsScale(float NewBoundsScale); // Function Engine.PrimitiveComponent.SetBoundsScale // (NetRequest|Native|Event|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetAngularDamping(float InDamping); // Function Engine.PrimitiveComponent.SetAngularDamping // (Net|NetRequest|Exec|Native|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetAllUseCCD(bool InUseCCD); // Function Engine.PrimitiveComponent.SetAllUseCCD // (NetReliableExec|Native|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetAllPhysicsLinearVelocity(struct FVector NewVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsLinearVelocity // (Net|NetReliableNetRequest|Native|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetAllPhysicsAngularVelocityInRadians(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInRadians // (Net|NetReliableNative|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetAllPhysicsAngularVelocityInDegrees(struct FVector& NewAngVel, bool bAddToCurrent); // Function Engine.PrimitiveComponent.SetAllPhysicsAngularVelocityInDegrees // (Net|NetReliableNetRequest|Exec|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void SetAllMassScale(float InMassScale); // Function Engine.PrimitiveComponent.SetAllMassScale // (Net|NetRequest|Exec|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FVector ScaleByMomentOfInertia(struct FVector InputVector, struct FName BoneName); // Function Engine.PrimitiveComponent.ScaleByMomentOfInertia // (Net|Exec|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void PutRigidBodyToSleep(struct FName BoneName); // Function Engine.PrimitiveComponent.PutRigidBodyToSleep // (Net|NetRequest|Static|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool K2_SphereTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, float SphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereTraceComponent // (Net|NetReliableNetRequest|Native|Event|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool K2_SphereOverlapComponent(struct FVector InSphereCentre, float InSphereRadius, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_SphereOverlapComponent // (NetReliableExec|Event|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool K2_LineTraceComponent(struct FVector TraceStart, struct FVector TraceEnd, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_LineTraceComponent // (NetRequest|Exec|Native|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool K2_IsQueryCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsQueryCollisionEnabled // (Net|NetReliableExec|Native|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool K2_IsPhysicsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsPhysicsCollisionEnabled // (NetReliableExec|Native|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool K2_IsCollisionEnabled(); // Function Engine.PrimitiveComponent.K2_IsCollisionEnabled // (Net|Exec|Native|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool K2_BoxOverlapComponent(struct FVector InBoxCentre, struct FBox InBox, bool bTraceComplex, bool bShowTrace, bool bPersistentShowTrace, struct FVector& HitLocation, struct FVector& HitNormal, struct FName& BoneName, struct FHitResult& OutHit); // Function Engine.PrimitiveComponent.K2_BoxOverlapComponent // (NetRequest|Exec|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool IsOverlappingComponent(struct UPrimitiveComponent* OtherComp); // Function Engine.PrimitiveComponent.IsOverlappingComponent // (NetReliableExec|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.PrimitiveComponent.IsOverlappingActor // (Exec|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool IsGravityEnabled(); // Function Engine.PrimitiveComponent.IsGravityEnabled // (Net|Exec|Native|NetResponse|Static|Private|Protected|Delegate|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool IsAnyRigidBodyAwake(); // Function Engine.PrimitiveComponent.IsAnyRigidBodyAwake // (Net|NetReliableNetRequest|NetResponse|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void IgnoreComponentWhenMoving(struct UPrimitiveComponent* Component, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreComponentWhenMoving // (NetReliableNetRequest|Exec|Native|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void IgnoreActorWhenMoving(struct AActor* Actor, bool bShouldIgnore); // Function Engine.PrimitiveComponent.IgnoreActorWhenMoving // (Net|NetReliableExec|Native|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FWalkableSlopeOverride GetWalkableSlopeOverride(); // Function Engine.PrimitiveComponent.GetWalkableSlopeOverride // (NetReliableExec|Native|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	struct FVector GetPhysicsLinearVelocityAtPoint(struct FVector Point, struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocityAtPoint // (NetRequest|Native|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FVector GetPhysicsLinearVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsLinearVelocity // (NetReliableNative|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FVector GetPhysicsAngularVelocityInRadians(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInRadians // (Net|NetReliableNetRequest|Exec|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FVector GetPhysicsAngularVelocityInDegrees(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocityInDegrees // (NetRequest|Exec|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FVector GetPhysicsAngularVelocity(struct FName BoneName); // Function Engine.PrimitiveComponent.GetPhysicsAngularVelocity // (NetRequest|Exec|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OutOverlappingComponents); // Function Engine.PrimitiveComponent.GetOverlappingComponents // (Net|Exec|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, struct AActor* ClassFilter); // Function Engine.PrimitiveComponent.GetOverlappingActors // (NetReliableNetRequest|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	int32_t GetNumMaterials(); // Function Engine.PrimitiveComponent.GetNumMaterials // (Net|NetRequest|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct UMaterialInterface* GetMaterialFromCollisionFaceIndex(int32_t FaceIndex, int32_t& SectionIndex); // Function Engine.PrimitiveComponent.GetMaterialFromCollisionFaceIndex // (Net|Event|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct UMaterialInterface* GetMaterial(int32_t ElementIndex); // Function Engine.PrimitiveComponent.GetMaterial // (Net|NetReliableNetRequest|Exec|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	float GetMassScale(struct FName BoneName); // Function Engine.PrimitiveComponent.GetMassScale // (NetRequest|Exec|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	float GetMass(); // Function Engine.PrimitiveComponent.GetMass // (Net|NetReliableExec|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	float GetLinearDamping(); // Function Engine.PrimitiveComponent.GetLinearDamping // (NetReliableExec|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FVector GetInertiaTensor(struct FName BoneName); // Function Engine.PrimitiveComponent.GetInertiaTensor // (Exec|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool GetGenerateOverlapEvents(); // Function Engine.PrimitiveComponent.GetGenerateOverlapEvents // (Net|NetReliableNetRequest|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	enum class ECollisionResponse GetCollisionResponseToChannel(enum class ECollisionChannel Channel); // Function Engine.PrimitiveComponent.GetCollisionResponseToChannel // (Net|NetRequest|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FName GetCollisionProfileName(); // Function Engine.PrimitiveComponent.GetCollisionProfileName // (NetRequest|Native|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	enum class ECollisionChannel GetCollisionObjectType(); // Function Engine.PrimitiveComponent.GetCollisionObjectType // (Net|NetReliableExec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Delegate|NetServer|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	enum class ECollisionEnabled GetCollisionEnabled(); // Function Engine.PrimitiveComponent.GetCollisionEnabled // (Net|NetReliableNative|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	float GetClosestPointOnCollision(struct FVector& Point, struct FVector& OutPointOnBody, struct FName BoneName); // Function Engine.PrimitiveComponent.GetClosestPointOnCollision // (NetReliableNetRequest|Exec|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct FVector GetCenterOfMass(struct FName BoneName); // Function Engine.PrimitiveComponent.GetCenterOfMass // (Net|NetReliableExec|MulticastDelegate|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	float GetAngularDamping(); // Function Engine.PrimitiveComponent.GetAngularDamping // (Net|NetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct UMaterialInstanceDynamic* CreateDynamicMaterialInstance(int32_t ElementIndex, struct UMaterialInterface* SourceMaterial, struct FName OptionalName); // Function Engine.PrimitiveComponent.CreateDynamicMaterialInstance // (Exec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamicFromMaterial(int32_t ElementIndex, struct UMaterialInterface* Parent); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamicFromMaterial // (Net|NetRequest|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct UMaterialInstanceDynamic* CreateAndSetMaterialInstanceDynamic(int32_t ElementIndex); // Function Engine.PrimitiveComponent.CreateAndSetMaterialInstanceDynamic // (Net|NetReliableNative|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct TArray<struct UPrimitiveComponent*> CopyArrayOfMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreComponents // (Net|NetReliableNetRequest|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	struct TArray<struct AActor*> CopyArrayOfMoveIgnoreActors(); // Function Engine.PrimitiveComponent.CopyArrayOfMoveIgnoreActors // (Net|NetRequest|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void ClearMoveIgnoreComponents(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreComponents // (Net|NetReliableExec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void ClearMoveIgnoreActors(); // Function Engine.PrimitiveComponent.ClearMoveIgnoreActors // (Net|NetReliableExec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	bool CanCharacterStepUp(struct APawn* Pawn); // Function Engine.PrimitiveComponent.CanCharacterStepUp // (Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddTorqueInRadians(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInRadians // (Net|NetReliableNetRequest|Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddTorqueInDegrees(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorqueInDegrees // (Net|NetReliableEvent|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddTorque(struct FVector Torque, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddTorque // (Net|NetReliableNetRequest|Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddRadialImpulse(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bVelChange); // Function Engine.PrimitiveComponent.AddRadialImpulse // (Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddRadialForce(struct FVector Origin, float Radius, float Strength, enum class ERadialImpulseFalloff Falloff, bool bAccelChange); // Function Engine.PrimitiveComponent.AddRadialForce // (Net|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddImpulseAtLocation(struct FVector Impulse, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddImpulseAtLocation // (Net|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddImpulse // (Net|NetRequest|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddForceAtLocationLocal(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocationLocal // (Exec|Native|Event|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddForceAtLocation(struct FVector Force, struct FVector Location, struct FName BoneName); // Function Engine.PrimitiveComponent.AddForceAtLocation // (Net|NetReliableNative|Event|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddForce(struct FVector Force, struct FName BoneName, bool bAccelChange); // Function Engine.PrimitiveComponent.AddForce // (Net|NetReliableNetRequest|Exec|Event|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddAngularImpulseInRadians(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInRadians // (NetReliableExec|Event|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddAngularImpulseInDegrees(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulseInDegrees // (Net|NetRequest|Event|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
	void AddAngularImpulse(struct FVector Impulse, struct FName BoneName, bool bVelChange); // Function Engine.PrimitiveComponent.AddAngularImpulse // (Net|Event|Static|NetMulticast|UbergraphFunction|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b5c0
};

// Class Engine.MeshComponent
// Size: 0x580 (Inherited: 0x540)
struct UMeshComponent : UPrimitiveComponent {
	struct TArray<struct UMaterialInterface*> OverrideMaterials; // 0x540(0x10)
	bool bNeedMultiplePass; // 0x550(0x01)
	bool bForceFrontFaceCull; // 0x551(0x01)
	bool bIgnoreTranslucentSection; // 0x552(0x01)
	char pad_553[0x5]; // 0x553(0x05)
	struct UMaterialInterface* MultiplePassMaterial; // 0x558(0x08)
	char pad_560[0x10]; // 0x560(0x10)
	char bEnableMaterialParameterCaching : 1; // 0x570(0x01)
	char pad_570_1 : 7; // 0x570(0x01)
	char pad_571[0xf]; // 0x571(0x0f)

	void SetVectorParameterValueOnMaterials(struct FName ParameterName, struct FVector ParameterValue); // Function Engine.MeshComponent.SetVectorParameterValueOnMaterials // (Exec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f317b7fc0
	void SetScalarParameterValueOnMaterials(struct FName ParameterName, float ParameterValue); // Function Engine.MeshComponent.SetScalarParameterValueOnMaterials // (NetRequest|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b800
	void PrestreamTextures(float Seconds, bool bPrioritizeCharacterTextures, int32_t CinematicTextureGroups); // Function Engine.MeshComponent.PrestreamTextures // (Net|NetReliableExec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b800
	bool IsMaterialSlotNameValid(struct FName MaterialSlotName); // Function Engine.MeshComponent.IsMaterialSlotNameValid // (Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b800
	struct TArray<struct FName> GetMaterialSlotNames(); // Function Engine.MeshComponent.GetMaterialSlotNames // (NetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b800
	struct TArray<struct UMaterialInterface*> GetMaterials(); // Function Engine.MeshComponent.GetMaterials // (NetReliableNetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b800
	int32_t GetMaterialIndex(struct FName MaterialSlotName); // Function Engine.MeshComponent.GetMaterialIndex // (NetReliableEvent|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8b800
};

// Class Engine.SkinnedMeshComponent
// Size: 0x790 (Inherited: 0x580)
struct USkinnedMeshComponent : UMeshComponent {
	struct USkeletalMesh* SkeletalMesh; // 0x578(0x08)
	struct TWeakObjectPtr<struct USkinnedMeshComponent> MasterPoseComponent; // 0x580(0x08)
	struct TArray<enum class ESkinCacheUsage> SkinCacheUsage; // 0x588(0x10)
	char pad_5A0[0xf0]; // 0x5a0(0xf0)
	struct UPhysicsAsset* PhysicsAssetOverride; // 0x690(0x08)
	int32_t ForcedLodModel; // 0x698(0x04)
	int32_t MinLodModel; // 0x69c(0x04)
	char pad_6A0[0xc]; // 0x6a0(0x0c)
	float StreamingDistanceMultiplier; // 0x6ac(0x04)
	char pad_6B0[0x8]; // 0x6b0(0x08)
	struct TArray<struct FSkelMeshComponentLODInfo> LODInfo; // 0x6b8(0x10)
	char pad_6C8[0x24]; // 0x6c8(0x24)
	enum class EVisibilityBasedAnimTickOption VisibilityBasedAnimTickOption; // 0x6ec(0x01)
	char pad_6ED[0x1]; // 0x6ed(0x01)
	char pad_6EE_0 : 2; // 0x6ee(0x01)
	char bOverrideMinLod : 1; // 0x6ee(0x01)
	char bUseBoundsFromMasterPoseComponent : 1; // 0x6ee(0x01)
	char bForceWireframe : 1; // 0x6ee(0x01)
	char bDisplayBones : 1; // 0x6ee(0x01)
	char bDisableMorphTarget : 1; // 0x6ee(0x01)
	char bHideSkin : 1; // 0x6ee(0x01)
	char bPerBoneMotionBlur : 1; // 0x6ef(0x01)
	char bComponentUseFixedSkelBounds : 1; // 0x6ef(0x01)
	char bConsiderAllBodiesForBounds : 1; // 0x6ef(0x01)
	char bOverrideMeshMinScreenSize : 1; // 0x6ef(0x01)
	char bSyncAttachParentLOD : 1; // 0x6ef(0x01)
	char bCanHighlightSelectedSections : 1; // 0x6ef(0x01)
	char bRecentlyRendered : 1; // 0x6ef(0x01)
	char bCastCapsuleDirectShadow : 1; // 0x6ef(0x01)
	char bCastCapsuleIndirectShadow : 1; // 0x6f0(0x01)
	char bCPUSkinning : 1; // 0x6f0(0x01)
	char bEnableUpdateRateOptimizations : 1; // 0x6f0(0x01)
	char bDisplayDebugUpdateRateOptimizations : 1; // 0x6f0(0x01)
	char bRenderStatic : 1; // 0x6f0(0x01)
	char bIgnoreMasterPoseComponentLOD : 1; // 0x6f0(0x01)
	char pad_6F0_6 : 2; // 0x6f0(0x01)
	char bCachedLocalBoundsUpToDate : 1; // 0x6f1(0x01)
	char pad_6F1_1 : 1; // 0x6f1(0x01)
	char bForceMeshObjectUpdate : 1; // 0x6f1(0x01)
	char pad_6F1_3 : 5; // 0x6f1(0x01)
	char pad_6F2[0x2]; // 0x6f2(0x02)
	float CapsuleIndirectShadowMinVisibility; // 0x6f4(0x04)
	char pad_6F8[0x10]; // 0x6f8(0x10)
	struct FBoxSphereBounds CachedWorldSpaceBounds; // 0x708(0x1c)
	char pad_724[0xc]; // 0x724(0x0c)
	struct FMatrix CachedWorldToLocalTransform; // 0x730(0x40)
	char pad_770[0x20]; // 0x770(0x20)

	void UnloadSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.UnloadSkinWeightProfile // (NetReliableNetRequest|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void UnHideBoneByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.UnHideBoneByName // (NetRequest|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void TransformToBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformToBoneSpace // (Net|NetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void TransformFromBoneSpace(struct FName BoneName, struct FVector InPosition, struct FRotator InRotation, struct FVector& OutPosition, struct FRotator& OutRotation); // Function Engine.SkinnedMeshComponent.TransformFromBoneSpace // (NetReliableNetRequest|Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void ShowMaterialSection(int32_t MaterialID, int32_t SectionIndex, bool bShow, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowMaterialSection // (Net|Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void ShowAllMaterialSections(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ShowAllMaterialSections // (Net|NetReliableNetRequest|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetVertexColorOverride_LinearColor(int32_t LODIndex, struct TArray<struct FLinearColor>& VertexColors); // Function Engine.SkinnedMeshComponent.SetVertexColorOverride_LinearColor // (NetRequest|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	bool SetSkinWeightProfile(struct FName InProfileName); // Function Engine.SkinnedMeshComponent.SetSkinWeightProfile // (NetReliableNative|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetSkinWeightOverride(int32_t LODIndex, struct TArray<struct FSkelMeshSkinWeightInfo>& SkinWeights); // Function Engine.SkinnedMeshComponent.SetSkinWeightOverride // (NetReliableNetRequest|Exec|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetSkeletalMesh(struct USkeletalMesh* NewMesh, bool bReinitPose, bool bForceSkipTickAnimation); // Function Engine.SkinnedMeshComponent.SetSkeletalMesh // (NetReliableExec|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetRenderStatic(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetRenderStatic // (Exec|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetPhysicsAsset(struct UPhysicsAsset* NewPhysicsAsset, bool bForceReInit); // Function Engine.SkinnedMeshComponent.SetPhysicsAsset // (NetRequest|NetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetMinLOD(int32_t InNewMinLOD); // Function Engine.SkinnedMeshComponent.SetMinLOD // (NetReliableNetResponse|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetMasterPoseComponent(struct USkinnedMeshComponent* NewMasterBoneComponent, bool bForceUpdate); // Function Engine.SkinnedMeshComponent.SetMasterPoseComponent // (Net|NetReliableNetRequest|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetForcedLOD(int32_t InNewForcedLOD); // Function Engine.SkinnedMeshComponent.SetForcedLOD // (Net|NetRequest|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetCastCapsuleIndirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleIndirectShadow // (Net|NetReliableExec|Native|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetCastCapsuleDirectShadow(bool bNewValue); // Function Engine.SkinnedMeshComponent.SetCastCapsuleDirectShadow // (Net|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void SetCapsuleIndirectShadowMinVisibility(float NewValue); // Function Engine.SkinnedMeshComponent.SetCapsuleIndirectShadowMinVisibility // (Net|NetReliableNetRequest|Native|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	bool IsUsingSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.IsUsingSkinWeightProfile // (NetReliableNetRequest|Native|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	bool IsMaterialSectionShown(int32_t MaterialID, int32_t LODIndex); // Function Engine.SkinnedMeshComponent.IsMaterialSectionShown // (Net|NetReliableNative|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	bool IsBoneHiddenByName(struct FName BoneName); // Function Engine.SkinnedMeshComponent.IsBoneHiddenByName // (Net|Native|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void HideBoneByName(struct FName BoneName, enum class EPhysBodyOp PhysBodyOption); // Function Engine.SkinnedMeshComponent.HideBoneByName // (Net|Exec|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	bool GetTwistAndSwingAngleOfDeltaRotationFromRefPose(struct FName BoneName, float& OutTwistAngle, float& OutSwingAngle); // Function Engine.SkinnedMeshComponent.GetTwistAndSwingAngleOfDeltaRotationFromRefPose // (Net|NetRequest|Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	struct FName GetSocketBoneName(struct FName InSocketName); // Function Engine.SkinnedMeshComponent.GetSocketBoneName // (Event|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	struct FVector GetRefPosePosition(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetRefPosePosition // (Net|NetRequest|Exec|Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	struct FName GetParentBone(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetParentBone // (Net|NetReliableExec|Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	int32_t GetNumLODs(); // Function Engine.SkinnedMeshComponent.GetNumLODs // (NetReliableExec|Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	int32_t GetNumBones(); // Function Engine.SkinnedMeshComponent.GetNumBones // (NetReliableExec|Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	int32_t GetForcedLOD(); // Function Engine.SkinnedMeshComponent.GetForcedLOD // (Net|Exec|Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	struct FTransform GetDeltaTransformFromRefPose(struct FName BoneName, struct FName BaseName); // Function Engine.SkinnedMeshComponent.GetDeltaTransformFromRefPose // (Net|NetRequest|Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	struct FName GetCurrentSkinWeightProfileName(); // Function Engine.SkinnedMeshComponent.GetCurrentSkinWeightProfileName // (NetRequest|Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	struct FName GetBoneName(int32_t BoneIndex); // Function Engine.SkinnedMeshComponent.GetBoneName // (NetReliableNative|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	int32_t GetBoneIndex(struct FName BoneName); // Function Engine.SkinnedMeshComponent.GetBoneIndex // (Native|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	struct FName FindClosestBone_K2(struct FVector TestLocation, struct FVector& BoneLocation, float IgnoreScale, bool bRequirePhysicsAsset); // Function Engine.SkinnedMeshComponent.FindClosestBone_K2 // (NetReliableExec|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void ClearVertexColorOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearVertexColorOverride // (Exec|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void ClearSkinWeightProfile(); // Function Engine.SkinnedMeshComponent.ClearSkinWeightProfile // (Net|NetReliableNetRequest|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	void ClearSkinWeightOverride(int32_t LODIndex); // Function Engine.SkinnedMeshComponent.ClearSkinWeightOverride // (Net|NetRequest|Static|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
	bool BoneIsChildOf(struct FName BoneName, struct FName ParentBoneName); // Function Engine.SkinnedMeshComponent.BoneIsChildOf // (NetReliableStatic|NetMulticast|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8ba40
};

// Class Engine.SkeletalMeshComponent
// Size: 0xc20 (Inherited: 0x790)
struct USkeletalMeshComponent : USkinnedMeshComponent {
	struct UObject* AnimBlueprintGeneratedClass; // 0x790(0x08)
	struct UAnimInstance* AnimClass; // 0x798(0x08)
	struct UAnimInstance* AnimScriptInstance; // 0x7a0(0x08)
	struct UAnimInstance* PostProcessAnimInstance; // 0x7a8(0x08)
	struct FSingleAnimationPlayData AnimationData; // 0x7b0(0x18)
	char pad_7C8[0x10]; // 0x7c8(0x10)
	struct FVector RootBoneTranslation; // 0x7d8(0x0c)
	struct FVector LineCheckBoundsScale; // 0x7e4(0x0c)
	char pad_7F0[0x20]; // 0x7f0(0x20)
	struct TArray<struct UAnimInstance*> LinkedInstances; // 0x810(0x10)
	struct TArray<struct FTransform> CachedBoneSpaceTransforms; // 0x820(0x10)
	struct TArray<struct FTransform> CachedComponentSpaceTransforms; // 0x830(0x10)
	char pad_840[0x20]; // 0x840(0x20)
	float GlobalAnimRateScale; // 0x860(0x04)
	enum class EKinematicBonesUpdateToPhysics KinematicBonesUpdateType; // 0x864(0x01)
	enum class EPhysicsTransformUpdateMode PhysicsTransformUpdateMode; // 0x865(0x01)
	char pad_866[0x1]; // 0x866(0x01)
	enum class EAnimationMode AnimationMode; // 0x867(0x01)
	char pad_868[0x1]; // 0x868(0x01)
	char bDisablePostProcessBlueprint : 1; // 0x869(0x01)
	char pad_869_1 : 1; // 0x869(0x01)
	char bUpdateOverlapsOnAnimationFinalize : 1; // 0x869(0x01)
	char pad_869_3 : 1; // 0x869(0x01)
	char bHasValidBodies : 1; // 0x869(0x01)
	char pad_869_5 : 1; // 0x869(0x01)
	char bBlendPhysics : 1; // 0x869(0x01)
	char bEnablePhysicsOnDedicatedServer : 1; // 0x869(0x01)
	char bUpdateJointsFromAnimation : 1; // 0x86a(0x01)
	char bDisableClothSimulation : 1; // 0x86a(0x01)
	char bDisableRigidBodyAnimNode : 1; // 0x86a(0x01)
	char bAllowAnimCurveEvaluation : 1; // 0x86a(0x01)
	char bDisableAnimCurves : 1; // 0x86a(0x01)
	char pad_86A_5 : 3; // 0x86a(0x01)
	char bCollideWithEnvironment : 1; // 0x86b(0x01)
	char bCollideWithAttachedChildren : 1; // 0x86b(0x01)
	char bLocalSpaceSimulation : 1; // 0x86b(0x01)
	char bResetAfterTeleport : 1; // 0x86b(0x01)
	char pad_86B_4 : 1; // 0x86b(0x01)
	char bDeferKinematicBoneUpdate : 1; // 0x86b(0x01)
	char bNoSkeletonUpdate : 1; // 0x86b(0x01)
	char bPauseAnims : 1; // 0x86b(0x01)
	char bUseRefPoseOnInitAnim : 1; // 0x86c(0x01)
	char bEnablePerPolyCollision : 1; // 0x86c(0x01)
	char pad_86C_2 : 1; // 0x86c(0x01)
	char bForceRefpose : 1; // 0x86c(0x01)
	char bOnlyAllowAutonomousTickPose : 1; // 0x86c(0x01)
	char bIsAutonomousTickPose : 1; // 0x86c(0x01)
	char bOldForceRefPose : 1; // 0x86c(0x01)
	char bShowPrePhysBones : 1; // 0x86c(0x01)
	char bRequiredBonesUpToDate : 1; // 0x86d(0x01)
	char bAnimTreeInitialised : 1; // 0x86d(0x01)
	char bIncludeComponentLocationIntoBounds : 1; // 0x86d(0x01)
	char bEnableLineCheckWithBounds : 1; // 0x86d(0x01)
	char bUseBendingElements : 1; // 0x86d(0x01)
	char bUseTetrahedralConstraints : 1; // 0x86d(0x01)
	char bUseThinShellVolumeConstraints : 1; // 0x86d(0x01)
	char bUseSelfCollisions : 1; // 0x86d(0x01)
	char bUseContinuousCollisionDetection : 1; // 0x86e(0x01)
	char bPropagateCurvesToSlaves : 1; // 0x86e(0x01)
	char bSkipKinematicUpdateWhenInterpolating : 1; // 0x86e(0x01)
	char bSkipBoundsUpdateWhenInterpolating : 1; // 0x86e(0x01)
	char pad_86E_4 : 1; // 0x86e(0x01)
	char bNeedsQueuedAnimEventsDispatched : 1; // 0x86e(0x01)
	char pad_86E_6 : 2; // 0x86e(0x01)
	char pad_86F[0x1]; // 0x86f(0x01)
	uint16_t CachedAnimCurveUidVersion; // 0x870(0x02)
	enum class EClothMassMode MassMode; // 0x872(0x01)
	char pad_873[0x1]; // 0x873(0x01)
	float UniformMass; // 0x874(0x04)
	float TotalMass; // 0x878(0x04)
	float Density; // 0x87c(0x04)
	float MinPerParticleMass; // 0x880(0x04)
	float ClothBlendWeight; // 0x884(0x04)
	float EdgeStiffness; // 0x888(0x04)
	float BendingStiffness; // 0x88c(0x04)
	float AreaStiffness; // 0x890(0x04)
	float VolumeStiffness; // 0x894(0x04)
	float StrainLimitingStiffness; // 0x898(0x04)
	float ShapeTargetStiffness; // 0x89c(0x04)
	struct TArray<struct FName> DisallowedAnimCurves; // 0x8a0(0x10)
	struct UBodySetup* BodySetup; // 0x8b0(0x08)
	char pad_8B8[0x8]; // 0x8b8(0x08)
	struct FMulticastInlineDelegate OnConstraintBroken; // 0x8c0(0x10)
	struct UClothingSimulationFactory* ClothingSimulationFactory; // 0x8d0(0x08)
	char pad_8D8[0xd0]; // 0x8d8(0xd0)
	float TeleportDistanceThreshold; // 0x9a8(0x04)
	float TeleportRotationThreshold; // 0x9ac(0x04)
	char pad_9B0[0x8]; // 0x9b0(0x08)
	uint32_t LastPoseTickFrame; // 0x9b8(0x04)
	char pad_9BC[0x54]; // 0x9bc(0x54)
	struct UClothingSimulationInteractor* ClothingInteractor; // 0xa10(0x08)
	char pad_A18[0xc8]; // 0xa18(0xc8)
	struct FMulticastInlineDelegate OnAnimInitialized; // 0xae0(0x10)
	char pad_AF0[0x130]; // 0xaf0(0x130)

	void UnlinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.UnlinkAnimClassLayers // (Net|NetRequest|Event|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bec0
	void UnbindClothFromMasterPoseComponent(bool bRestoreSimulationSpace); // Function Engine.SkeletalMeshComponent.UnbindClothFromMasterPoseComponent // (NetReliableEvent|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ToggleDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.ToggleDisablePostProcessBlueprint // (NetReliableEvent|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void TermBodiesBelow(struct FName ParentBoneName); // Function Engine.SkeletalMeshComponent.TermBodiesBelow // (Event|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SuspendClothingSimulation(); // Function Engine.SkeletalMeshComponent.SuspendClothingSimulation // (Net|NetReliableNetRequest|Exec|Native|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void Stop(); // Function Engine.SkeletalMeshComponent.Stop // (Net|NetReliableNetRequest|Exec|Native|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.SkeletalMeshComponent.SnapshotPose // (NetRequest|Exec|Native|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetUpdateAnimationInEditor(bool NewUpdateState); // Function Engine.SkeletalMeshComponent.SetUpdateAnimationInEditor // (NetRequest|Exec|Native|NetResponse|Static|NetMulticast|MulticastDelegate|Private|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetTeleportRotationThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportRotationThreshold // (NetReliableExec|Native|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetTeleportDistanceThreshold(float Threshold); // Function Engine.SkeletalMeshComponent.SetTeleportDistanceThreshold // (Exec|Native|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetPosition(float InPos, bool bFireNotifies); // Function Engine.SkeletalMeshComponent.SetPosition // (NetRequest|Native|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetPlayRate(float Rate); // Function Engine.SkeletalMeshComponent.SetPlayRate // (NetReliableNative|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetPhysicsBlendWeight(float PhysicsBlendWeight); // Function Engine.SkeletalMeshComponent.SetPhysicsBlendWeight // (Native|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetNotifyRigidBodyCollisionBelow(bool bNewNotifyRigidBodyCollision, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetNotifyRigidBodyCollisionBelow // (NetRequest|Exec|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetMorphTarget(struct FName MorphTargetName, float Value, bool bRemoveZeroWeight); // Function Engine.SkeletalMeshComponent.SetMorphTarget // (Exec|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetEnablePhysicsBlending(bool bNewBlendPhysics); // Function Engine.SkeletalMeshComponent.SetEnablePhysicsBlending // (NetReliableNetRequest|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetEnableGravityOnAllBodiesBelow(bool bEnableGravity, struct FName BoneName, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetEnableGravityOnAllBodiesBelow // (Net|Static|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetEnableBodyGravity(bool bEnableGravity, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetEnableBodyGravity // (NetReliableNetRequest|Exec|Native|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetDisablePostProcessBlueprint(bool bInDisablePostProcess); // Function Engine.SkeletalMeshComponent.SetDisablePostProcessBlueprint // (NetRequest|Exec|Native|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetDisableAnimCurves(bool bInDisableAnimCurves); // Function Engine.SkeletalMeshComponent.SetDisableAnimCurves // (NetReliableExec|Native|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetConstraintProfileForAll(struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfileForAll // (Net|NetReliableNetRequest|Native|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetConstraintProfile(struct FName JointName, struct FName ProfileName, bool bDefaultIfNotFound); // Function Engine.SkeletalMeshComponent.SetConstraintProfile // (NetReliableNative|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetClothMaxDistanceScale(float Scale); // Function Engine.SkeletalMeshComponent.SetClothMaxDistanceScale // (Native|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetBodyNotifyRigidBodyCollision(bool bNewNotifyRigidBodyCollision, struct FName BoneName); // Function Engine.SkeletalMeshComponent.SetBodyNotifyRigidBodyCollision // (Net|NetRequest|Exec|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAnimClass(struct UObject* NewClass); // Function Engine.SkeletalMeshComponent.SetAnimClass // (Net|NetReliableNetRequest|Exec|Native|NetResponse|Public|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAnimationMode(enum class EAnimationMode InAnimationMode); // Function Engine.SkeletalMeshComponent.SetAnimationMode // (Net|NetReliableExec|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAnimation(struct UAnimationAsset* NewAnimToPlay); // Function Engine.SkeletalMeshComponent.SetAnimation // (Net|Exec|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAngularLimits(struct FName InBoneName, float Swing1LimitAngle, float TwistLimitAngle, float Swing2LimitAngle); // Function Engine.SkeletalMeshComponent.SetAngularLimits // (NetRequest|Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllowRigidBodyAnimNode(bool bInAllow, bool bReinitAnim); // Function Engine.SkeletalMeshComponent.SetAllowRigidBodyAnimNode // (Net|NetRequest|Exec|Native|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllowedAnimCurvesEvaluation(struct TArray<struct FName>& List, bool bAllow); // Function Engine.SkeletalMeshComponent.SetAllowedAnimCurvesEvaluation // (Event|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllowAnimCurveEvaluation(bool bInAllow); // Function Engine.SkeletalMeshComponent.SetAllowAnimCurveEvaluation // (NetReliableExec|Native|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllMotorsAngularVelocityDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularVelocityDrive // (NetReliableNetRequest|Native|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllMotorsAngularPositionDrive(bool bEnableSwingDrive, bool bEnableTwistDrive, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularPositionDrive // (Net|Native|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllMotorsAngularDriveParams(float InSpring, float InDamping, float InForceLimit, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllMotorsAngularDriveParams // (NetRequest|Exec|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllBodiesSimulatePhysics(bool bNewSimulate); // Function Engine.SkeletalMeshComponent.SetAllBodiesSimulatePhysics // (NetReliableExec|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllBodiesPhysicsBlendWeight(float PhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.SetAllBodiesPhysicsBlendWeight // (NetReliableNetRequest|NetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllBodiesBelowSimulatePhysics(struct FName& InBoneName, bool bNewSimulate, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowSimulatePhysics // (NetReliableNetResponse|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void SetAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float PhysicsBlendWeight, bool bSkipCustomPhysicsType, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.SetAllBodiesBelowPhysicsBlendWeight // (NetRequest|Exec|Native|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ResumeClothingSimulation(); // Function Engine.SkeletalMeshComponent.ResumeClothingSimulation // (NetRequest|Exec|Native|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ResetClothTeleportMode(); // Function Engine.SkeletalMeshComponent.ResetClothTeleportMode // (Net|NetReliableExec|Native|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ResetAnimInstanceDynamics(enum class ETeleportType InTeleportType); // Function Engine.SkeletalMeshComponent.ResetAnimInstanceDynamics // (Net|Exec|Native|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ResetAllowedAnimCurveEvaluation(); // Function Engine.SkeletalMeshComponent.ResetAllowedAnimCurveEvaluation // (Net|Exec|Native|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ResetAllBodiesSimulatePhysics(); // Function Engine.SkeletalMeshComponent.ResetAllBodiesSimulatePhysics // (Exec|Native|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void PlayAnimation(struct UAnimationAsset* NewAnimToPlay, bool bLooping); // Function Engine.SkeletalMeshComponent.PlayAnimation // (Net|NetRequest|Native|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void Play(bool bLooping); // Function Engine.SkeletalMeshComponent.Play // (Net|NetReliableNative|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void OverrideAnimationData(struct UAnimationAsset* InAnimToPlay, bool bIsLooping, bool bIsPlaying, float Position, float PlayRate); // Function Engine.SkeletalMeshComponent.OverrideAnimationData // (NetRequest|Exec|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void LinkAnimGraphByTag(struct FName InTag, struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimGraphByTag // (Net|Exec|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void LinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.LinkAnimClassLayers // (Net|NetReliableNetRequest|Event|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool K2_GetClosestPointOnPhysicsAsset(struct FVector& WorldPosition, struct FVector& ClosestWorldPosition, struct FVector& Normal, struct FName& BoneName, float& Distance); // Function Engine.SkeletalMeshComponent.K2_GetClosestPointOnPhysicsAsset // (Net|NetReliableNetRequest|Exec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool IsPlaying(); // Function Engine.SkeletalMeshComponent.IsPlaying // (NetReliableNetRequest|Exec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool IsClothingSimulationSuspended(); // Function Engine.SkeletalMeshComponent.IsClothingSimulationSuspended // (NetReliableNetRequest|Exec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool IsBodyGravityEnabled(struct FName BoneName); // Function Engine.SkeletalMeshComponent.IsBodyGravityEnabled // (Net|NetReliableExec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool HasValidAnimationInstance(); // Function Engine.SkeletalMeshComponent.HasValidAnimationInstance // (Net|NetReliableExec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	float GetTeleportRotationThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportRotationThreshold // (NetRequest|NetResponse|Static|MulticastDelegate|Private|NetServer|HasDefaults|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	float GetTeleportDistanceThreshold(); // Function Engine.SkeletalMeshComponent.GetTeleportDistanceThreshold // (NetRequest|NetResponse|Static|MulticastDelegate|Private|NetServer|HasDefaults|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct FVector GetSkeletalCenterOfMass(); // Function Engine.SkeletalMeshComponent.GetSkeletalCenterOfMass // (NetReliableExec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct UAnimInstance* GetPostProcessInstance(); // Function Engine.SkeletalMeshComponent.GetPostProcessInstance // (Net|Exec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	float GetPosition(); // Function Engine.SkeletalMeshComponent.GetPosition // (Exec|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	float GetPlayRate(); // Function Engine.SkeletalMeshComponent.GetPlayRate // (Net|NetReliableNetRequest|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	float GetMorphTarget(struct FName MorphTargetName); // Function Engine.SkeletalMeshComponent.GetMorphTarget // (Net|NetRequest|Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct UAnimInstance* GetLinkedAnimLayerInstanceByGroup(struct FName InGroup); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByGroup // (Net|NetReliableNative|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct UAnimInstance* GetLinkedAnimLayerInstanceByClass(struct UAnimInstance* InClass); // Function Engine.SkeletalMeshComponent.GetLinkedAnimLayerInstanceByClass // (Native|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void GetLinkedAnimGraphInstancesByTag(struct FName InTag, struct TArray<struct UAnimInstance*>& OutLinkedInstances); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstancesByTag // (Net|NetRequest|Exec|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct UAnimInstance* GetLinkedAnimGraphInstanceByTag(struct FName InTag); // Function Engine.SkeletalMeshComponent.GetLinkedAnimGraphInstanceByTag // (NetReliableExec|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool GetDisablePostProcessBlueprint(); // Function Engine.SkeletalMeshComponent.GetDisablePostProcessBlueprint // (NetReliableExec|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool GetDisableAnimCurves(); // Function Engine.SkeletalMeshComponent.GetDisableAnimCurves // (Net|Exec|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void GetCurrentJointAngles(struct FName InBoneName, float& Swing1Angle, float& TwistAngle, float& Swing2Angle); // Function Engine.SkeletalMeshComponent.GetCurrentJointAngles // (Net|NetReliableUbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	float GetClothMaxDistanceScale(); // Function Engine.SkeletalMeshComponent.GetClothMaxDistanceScale // (Net|UbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct UClothingSimulationInteractor* GetClothingSimulationInteractor(); // Function Engine.SkeletalMeshComponent.GetClothingSimulationInteractor // (NetReliableUbergraphFunction|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	float GetBoneMass(struct FName BoneName, bool bScaleMass); // Function Engine.SkeletalMeshComponent.GetBoneMass // (NetReliableNetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct UAnimInstance* GetAnimInstance(); // Function Engine.SkeletalMeshComponent.GetAnimInstance // (Net|NetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct UObject* GetAnimClass(); // Function Engine.SkeletalMeshComponent.GetAnimClass // (NetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	enum class EAnimationMode GetAnimationMode(); // Function Engine.SkeletalMeshComponent.GetAnimationMode // (Net|NetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool GetAllowRigidBodyAnimNode(); // Function Engine.SkeletalMeshComponent.GetAllowRigidBodyAnimNode // (NetReliableExec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	bool GetAllowedAnimCurveEvaluate(); // Function Engine.SkeletalMeshComponent.GetAllowedAnimCurveEvaluate // (Net|NetReliableExec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ForceClothNextUpdateTeleportAndReset(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleportAndReset // (NetReliableExec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ForceClothNextUpdateTeleport(); // Function Engine.SkeletalMeshComponent.ForceClothNextUpdateTeleport // (Net|Exec|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	struct FName FindConstraintBoneName(int32_t ConstraintIndex); // Function Engine.SkeletalMeshComponent.FindConstraintBoneName // (Net|NetReliableNetRequest|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void ClearMorphTargets(); // Function Engine.SkeletalMeshComponent.ClearMorphTargets // (Net|NetReliableNetRequest|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void BreakConstraint(struct FVector Impulse, struct FVector HitLocation, struct FName InBoneName); // Function Engine.SkeletalMeshComponent.BreakConstraint // (NetReliableNative|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void BindClothToMasterPoseComponent(); // Function Engine.SkeletalMeshComponent.BindClothToMasterPoseComponent // (Net|Native|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void AllowAnimCurveEvaluation(struct FName NameOfCurve, bool bAllow); // Function Engine.SkeletalMeshComponent.AllowAnimCurveEvaluation // (NetReliableNetRequest|Exec|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void AddImpulseToAllBodiesBelow(struct FVector Impulse, struct FName BoneName, bool bVelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddImpulseToAllBodiesBelow // (Exec|Event|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void AddForceToAllBodiesBelow(struct FVector Force, struct FName BoneName, bool bAccelChange, bool bIncludeSelf); // Function Engine.SkeletalMeshComponent.AddForceToAllBodiesBelow // (Net|NetReliableEvent|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
	void AccumulateAllBodiesBelowPhysicsBlendWeight(struct FName& InBoneName, float AddPhysicsBlendWeight, bool bSkipCustomPhysicsType); // Function Engine.SkeletalMeshComponent.AccumulateAllBodiesBelowPhysicsBlendWeight // (NetReliableNetRequest|Exec|Native|NetResponse|Static|NetMulticast|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8bc80
};

// Class Engine.Actor
// Size: 0x228 (Inherited: 0x28)
struct AActor : UObject {
	struct FActorTickFunction PrimaryActorTick; // 0x28(0x30)
	char bNetTemporary : 1; // 0x58(0x01)
	char bNetStartup : 1; // 0x58(0x01)
	char bOnlyRelevantToOwner : 1; // 0x58(0x01)
	char bAlwaysRelevant : 1; // 0x58(0x01)
	char bReplicateMovement : 1; // 0x58(0x01)
	char bHidden : 1; // 0x58(0x01)
	char bTearOff : 1; // 0x58(0x01)
	char bExchangedRoles : 1; // 0x58(0x01)
	char bNetLoadOnClient : 1; // 0x59(0x01)
	char bNetUseOwnerRelevancy : 1; // 0x59(0x01)
	char bRelevantForNetworkReplays : 1; // 0x59(0x01)
	char bRelevantForLevelBounds : 1; // 0x59(0x01)
	char bReplayRewindable : 1; // 0x59(0x01)
	char bAllowTickBeforeBeginPlay : 1; // 0x59(0x01)
	char bAutoDestroyWhenFinished : 1; // 0x59(0x01)
	char bCanBeDamaged : 1; // 0x59(0x01)
	char bBlockInput : 1; // 0x5a(0x01)
	char bCollideWhenPlacing : 1; // 0x5a(0x01)
	char bFindCameraComponentWhenViewTarget : 1; // 0x5a(0x01)
	char bGenerateOverlapEventsDuringLevelStreaming : 1; // 0x5a(0x01)
	char bIgnoresOriginShifting : 1; // 0x5a(0x01)
	char bEnableAutoLODGeneration : 1; // 0x5a(0x01)
	char bIsEditorOnlyActor : 1; // 0x5a(0x01)
	char bActorSeamlessTraveled : 1; // 0x5a(0x01)
	char bReplicates : 1; // 0x5b(0x01)
	char bCanBeInCluster : 1; // 0x5b(0x01)
	char bAllowReceiveTickEventOnDedicatedServer : 1; // 0x5b(0x01)
	char pad_5B_3 : 1; // 0x5b(0x01)
	char bDisableUpdateComponentToWorldIfHiddenInGame : 1; // 0x5b(0x01)
	char pad_5B_5 : 3; // 0x5b(0x01)
	char pad_5C[0x4]; // 0x5c(0x04)
	char pad_60_0 : 6; // 0x60(0x01)
	char bActorEnableCollision : 1; // 0x60(0x01)
	char bActorIsBeingDestroyed : 1; // 0x60(0x01)
	char pad_61[0x1]; // 0x61(0x01)
	enum class EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x62(0x01)
	enum class EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x63(0x01)
	enum class ENetRole RemoteRole; // 0x64(0x01)
	char pad_65[0x3]; // 0x65(0x03)
	struct FRepMovement ReplicatedMovement; // 0x68(0x34)
	float InitialLifeSpan; // 0x9c(0x04)
	float CustomTimeDilation; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct FRepAttachment AttachmentReplication; // 0xa8(0x40)
	struct AActor* Owner; // 0xe8(0x08)
	struct FName NetDriverName; // 0xf0(0x08)
	enum class ENetRole Role; // 0xf8(0x01)
	enum class ENetDormancy NetDormancy; // 0xf9(0x01)
	enum class ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0xfa(0x01)
	enum class EAutoReceiveInput AutoReceiveInput; // 0xfb(0x01)
	int32_t InputPriority; // 0xfc(0x04)
	struct UInputComponent* InputComponent; // 0x100(0x08)
	float NetCullDistanceSquared; // 0x108(0x04)
	int32_t NetTag; // 0x10c(0x04)
	float NetUpdateFrequency; // 0x110(0x04)
	float MinNetUpdateFrequency; // 0x114(0x04)
	float NetPriority; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)
	struct APawn* Instigator; // 0x120(0x08)
	struct TArray<struct AActor*> Children; // 0x128(0x10)
	struct USceneComponent* RootComponent; // 0x138(0x08)
	struct TArray<struct AMatineeActor*> ControllingMatineeActors; // 0x140(0x10)
	char pad_150[0x8]; // 0x150(0x08)
	struct TArray<struct FName> Layers; // 0x158(0x10)
	struct TWeakObjectPtr<struct UChildActorComponent> ParentComponent; // 0x168(0x08)
	char pad_170[0x8]; // 0x170(0x08)
	struct TArray<struct FName> Tags; // 0x178(0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x188(0x01)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x189(0x01)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x18a(0x01)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x18b(0x01)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0x18c(0x01)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x18d(0x01)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x18e(0x01)
	struct FMulticastSparseDelegate OnClicked; // 0x18f(0x01)
	struct FMulticastSparseDelegate OnReleased; // 0x190(0x01)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x191(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x192(0x01)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x193(0x01)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x194(0x01)
	struct FMulticastSparseDelegate OnActorHit; // 0x195(0x01)
	struct FMulticastSparseDelegate OnDestroyed; // 0x196(0x01)
	struct FMulticastSparseDelegate OnEndPlay; // 0x197(0x01)
	char pad_198[0x60]; // 0x198(0x60)
	struct TArray<struct UActorComponent*> InstanceComponents; // 0x1f8(0x10)
	struct TArray<struct UActorComponent*> BlueprintCreatedComponents; // 0x208(0x10)
	char pad_218[0x10]; // 0x218(0x10)

	bool WasRecentlyRendered(float Tolerance); // Function Engine.Actor.WasRecentlyRendered // (Net|NetReliableNative|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void UserConstructionScript(); // Function Engine.Actor.UserConstructionScript // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void TearOff(); // Function Engine.Actor.TearOff // (NetReliableNetRequest|Exec|Native|Event|NetResponse|Static|UbergraphFunction|Private|Protected|NetServer|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SnapRootComponentTo(struct AActor* InParentActor, struct FName InSocketName); // Function Engine.Actor.SnapRootComponentTo // (Native|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetTickGroup(enum class ETickingGroup NewTickGroup); // Function Engine.Actor.SetTickGroup // (Net|NetReliableExec|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetTickableWhenPaused(bool bTickableWhenPaused); // Function Engine.Actor.SetTickableWhenPaused // (Net|NetRequest|Exec|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetReplicates(bool bInReplicates); // Function Engine.Actor.SetReplicates // (Net|Exec|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetReplicateMovement(bool bInReplicateMovement); // Function Engine.Actor.SetReplicateMovement // (Net|NetReliableNetRequest|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetOwner(struct AActor* NewOwner); // Function Engine.Actor.SetOwner // (Net|NetRequest|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetNetDormancy(enum class ENetDormancy NewDormancy); // Function Engine.Actor.SetNetDormancy // (Net|NetReliableMulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void SetLifeSpan(float InLifespan); // Function Engine.Actor.SetLifeSpan // (Net|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetAutoDestroyWhenFinished(bool bVal); // Function Engine.Actor.SetAutoDestroyWhenFinished // (NetReliableNetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetActorTickInterval(float TickInterval); // Function Engine.Actor.SetActorTickInterval // (NetRequest|Exec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetActorTickEnabled(bool bEnabled); // Function Engine.Actor.SetActorTickEnabled // (NetReliableExec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetActorScale3D(struct FVector NewScale3D); // Function Engine.Actor.SetActorScale3D // (Exec|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetActorRelativeScale3D(struct FVector NewRelativeScale); // Function Engine.Actor.SetActorRelativeScale3D // (NetReliableNetRequest|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetActorHiddenInGame(bool bNewHidden); // Function Engine.Actor.SetActorHiddenInGame // (Net|NetReliableNative|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void SetActorEnableCollision(bool bNewActorEnableCollision); // Function Engine.Actor.SetActorEnableCollision // (Net|Native|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void RemoveTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.RemoveTickPrerequisiteComponent // (Net|NetReliableNetRequest|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void RemoveTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.RemoveTickPrerequisiteActor // (NetReliableNetRequest|Exec|Event|Static|UbergraphFunction|Public|Private|Delegate|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveTick(float DeltaSeconds); // Function Engine.Actor.ReceiveTick // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveRadialDamage(float DamageReceived, struct UDamageType* DamageType, struct FVector Origin, struct FHitResult& HitInfo, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveRadialDamage // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceivePointDamage(float Damage, struct UDamageType* DamageType, struct FVector HitLocation, struct FVector HitNormal, struct UPrimitiveComponent* HitComponent, struct FName BoneName, struct FVector ShotFromDirection, struct AController* InstigatedBy, struct AActor* DamageCauser, struct FHitResult& HitInfo); // Function Engine.Actor.ReceivePointDamage // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveHit(struct UPrimitiveComponent* MyComp, struct AActor* Other, struct UPrimitiveComponent* OtherComp, bool bSelfMoved, struct FVector HitLocation, struct FVector HitNormal, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Engine.Actor.ReceiveHit // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason); // Function Engine.Actor.ReceiveEndPlay // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveDestroyed(); // Function Engine.Actor.ReceiveDestroyed // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveBeginPlay(); // Function Engine.Actor.ReceiveBeginPlay // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveAnyDamage(float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Engine.Actor.ReceiveAnyDamage // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorOnReleased(struct FKey ButtonReleased); // Function Engine.Actor.ReceiveActorOnReleased // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorOnInputTouchLeave(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchLeave // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorOnInputTouchEnter(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnter // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorOnInputTouchEnd(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchEnd // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorOnInputTouchBegin(enum class ETouchIndex FingerIndex); // Function Engine.Actor.ReceiveActorOnInputTouchBegin // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorOnClicked(struct FKey ButtonPressed); // Function Engine.Actor.ReceiveActorOnClicked // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorEndOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorEndOverlap // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorEndCursorOver(); // Function Engine.Actor.ReceiveActorEndCursorOver // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorBeginOverlap(struct AActor* OtherActor); // Function Engine.Actor.ReceiveActorBeginOverlap // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ReceiveActorBeginCursorOver(); // Function Engine.Actor.ReceiveActorBeginCursorOver // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups); // Function Engine.Actor.PrestreamTextures // (Net|NetReliableExec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void OnRep_ReplicateMovement(); // Function Engine.Actor.OnRep_ReplicateMovement // (Net|Exec|Native|Event|Static|NetMulticast|MulticastDelegate|Public|Private|Protected|Delegate|NetServer|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void OnRep_ReplicatedMovement(); // Function Engine.Actor.OnRep_ReplicatedMovement // (Net|Exec|Native|Event|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void OnRep_Owner(); // Function Engine.Actor.OnRep_Owner // (NetReliableNetRequest|Exec|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetServer|HasOutParms|HasDefaults|NetClient|DLLImport|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void OnRep_Instigator(); // Function Engine.Actor.OnRep_Instigator // (NetReliableExec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void OnRep_AttachmentReplication(); // Function Engine.Actor.OnRep_AttachmentReplication // (Net|Exec|Native|Event|Private|Protected|HasOutParms|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void MakeNoise(float Loudness, struct APawn* NoiseInstigator, struct FVector NoiseLocation, float MaxRange, struct FName Tag); // Function Engine.Actor.MakeNoise // (NetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct UMaterialInstanceDynamic* MakeMIDForMaterial(struct UMaterialInterface* Parent); // Function Engine.Actor.MakeMIDForMaterial // (NetReliableEvent|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool K2_TeleportTo(struct FVector DestLocation, struct FRotator DestRotation); // Function Engine.Actor.K2_TeleportTo // (NetReliableNetRequest|Exec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool K2_SetActorTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorTransform // (NetReliableNetRequest|Native|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool K2_SetActorRotation(struct FRotator NewRotation, bool bTeleportPhysics); // Function Engine.Actor.K2_SetActorRotation // (NetReliableNative|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_SetActorRelativeTransform(struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeTransform // (NetReliableExec|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_SetActorRelativeRotation(struct FRotator NewRelativeRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeRotation // (NetRequest|NetResponse|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_SetActorRelativeLocation(struct FVector NewRelativeLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorRelativeLocation // (Net|NetRequest|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool K2_SetActorLocationAndRotation(struct FVector NewLocation, struct FRotator NewRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocationAndRotation // (Net|NetRequest|Native|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool K2_SetActorLocation(struct FVector NewLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_SetActorLocation // (Net|NetReliableNetRequest|Exec|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_OnReset(); // Function Engine.Actor.K2_OnReset // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_OnEndViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnEndViewTarget // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_OnBecomeViewTarget(struct APlayerController* PC); // Function Engine.Actor.K2_OnBecomeViewTarget // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct USceneComponent* K2_GetRootComponent(); // Function Engine.Actor.K2_GetRootComponent // (NetReliableNetRequest|Exec|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct TArray<struct UActorComponent*> K2_GetComponentsByClass(struct UActorComponent* ComponentClass); // Function Engine.Actor.K2_GetComponentsByClass // (Net|NetReliableExec|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FRotator K2_GetActorRotation(); // Function Engine.Actor.K2_GetActorRotation // (Net|NetReliableNetRequest|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector K2_GetActorLocation(); // Function Engine.Actor.K2_GetActorLocation // (Net|NetRequest|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_DetachFromActor(enum class EDetachmentRule LocationRule, enum class EDetachmentRule RotationRule, enum class EDetachmentRule ScaleRule); // Function Engine.Actor.K2_DetachFromActor // (Net|Event|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void K2_DestroyComponent(struct UActorComponent* Component); // Function Engine.Actor.K2_DestroyComponent // (Net|NetReliableNetRequest|Exec|Native|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_DestroyActor(); // Function Engine.Actor.K2_DestroyActor // (NetReliableNetRequest|Exec|Native|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AttachToComponent(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToComponent // (Net|NetReliableNetRequest|Native|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AttachToActor(struct AActor* ParentActor, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachToActor // (Native|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void K2_AttachRootComponentToActor(struct AActor* InParentActor, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentToActor // (Net|NetReliableExec|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AttachRootComponentTo(struct USceneComponent* InParent, struct FName InSocketName, enum class EAttachLocation AttachLocationType, bool bWeldSimulatedBodies); // Function Engine.Actor.K2_AttachRootComponentTo // (NetReliableNetRequest|Static|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void K2_AddActorWorldTransform(struct FTransform& DeltaTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldTransform // (NetReliableNetRequest|Exec|Native|Event|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AddActorWorldRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldRotation // (Net|NetReliableNetRequest|Native|Event|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AddActorWorldOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorWorldOffset // (Net|Native|Event|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AddActorLocalTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalTransform // (Net|Exec|Event|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AddActorLocalRotation(struct FRotator DeltaRotation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalRotation // (NetReliableEvent|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void K2_AddActorLocalOffset(struct FVector DeltaLocation, bool bSweep, struct FHitResult& SweepHitResult, bool bTeleport); // Function Engine.Actor.K2_AddActorLocalOffset // (NetRequest|Exec|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool IsOverlappingActor(struct AActor* Other); // Function Engine.Actor.IsOverlappingActor // (NetReliableExec|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool IsChildActor(); // Function Engine.Actor.IsChildActor // (Net|Exec|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool IsActorTickEnabled(); // Function Engine.Actor.IsActorTickEnabled // (Exec|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool IsActorBeingDestroyed(); // Function Engine.Actor.IsActorBeingDestroyed // (Exec|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool HasAuthority(); // Function Engine.Actor.HasAuthority // (Net|NetReliableNetRequest|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetVerticalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetVerticalDistanceTo // (NetRequest|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector GetVelocity(); // Function Engine.Actor.GetVelocity // (Net|NetReliableNative|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FTransform GetTransform(); // Function Engine.Actor.GetTransform // (NetReliableNative|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool GetTickableWhenPaused(); // Function Engine.Actor.GetTickableWhenPaused // (Net|Native|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetSquaredDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetSquaredDistanceTo // (Net|NetReliableNetRequest|Exec|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	enum class ENetRole GetRemoteRole(); // Function Engine.Actor.GetRemoteRole // (Net|NetReliableExec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct UChildActorComponent* GetParentComponent(); // Function Engine.Actor.GetParentComponent // (NetReliableNetRequest|Exec|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct AActor* GetParentActor(); // Function Engine.Actor.GetParentActor // (Net|NetRequest|Exec|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct AActor* GetOwner(); // Function Engine.Actor.GetOwner // (Net|NetReliableNetRequest|Exec|NetMulticast|MulticastDelegate|Private|Protected|HasOutParms|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void GetOverlappingComponents(struct TArray<struct UPrimitiveComponent*>& OverlappingComponents); // Function Engine.Actor.GetOverlappingComponents // (Net|NetReliableExec|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void GetOverlappingActors(struct TArray<struct AActor*>& OverlappingActors, struct AActor* ClassFilter); // Function Engine.Actor.GetOverlappingActors // (Net|NetReliableNetRequest|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	enum class ENetRole GetLocalRole(); // Function Engine.Actor.GetLocalRole // (NetReliableNetRequest|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	float GetLifeSpan(); // Function Engine.Actor.GetLifeSpan // (Net|NetRequest|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct AController* GetInstigatorController(); // Function Engine.Actor.GetInstigatorController // (Net|NetRequest|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct APawn* GetInstigator(); // Function Engine.Actor.GetInstigator // (NetRequest|NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector GetInputVectorAxisValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputVectorAxisValue // (NetResponse|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetInputAxisValue(struct FName InputAxisName); // Function Engine.Actor.GetInputAxisValue // (Net|NetRequest|Exec|Native|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetInputAxisKeyValue(struct FKey InputAxisKey); // Function Engine.Actor.GetInputAxisKeyValue // (NetReliableExec|Native|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetHorizontalDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDotProductTo // (Net|NetReliableNetRequest|Native|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetHorizontalDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetHorizontalDistanceTo // (Net|NetRequest|Native|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetGameTimeSinceCreation(); // Function Engine.Actor.GetGameTimeSinceCreation // (NetRequest|Native|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetDotProductTo(struct AActor* OtherActor); // Function Engine.Actor.GetDotProductTo // (Net|Native|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetDistanceTo(struct AActor* OtherActor); // Function Engine.Actor.GetDistanceTo // (Net|NetReliableNetRequest|Exec|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct TArray<struct UActorComponent*> GetComponentsByTag(struct UActorComponent* ComponentClass, struct FName Tag); // Function Engine.Actor.GetComponentsByTag // (Net|NetReliableExec|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct TArray<struct UActorComponent*> GetComponentsByInterface(struct UInterface* Interface); // Function Engine.Actor.GetComponentsByInterface // (Net|NetReliableNetRequest|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct UActorComponent* GetComponentByClass(struct UActorComponent* ComponentClass); // Function Engine.Actor.GetComponentByClass // (Net|NetRequest|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FName GetAttachParentSocketName(); // Function Engine.Actor.GetAttachParentSocketName // (Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct AActor* GetAttachParentActor(); // Function Engine.Actor.GetAttachParentActor // (Net|NetReliableNetRequest|Exec|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void GetAttachedActors(struct TArray<struct AActor*>& OutActors, bool bResetArray); // Function Engine.Actor.GetAttachedActors // (Net|Event|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void GetAllChildActors(struct TArray<struct AActor*>& ChildActors, bool bIncludeDescendants); // Function Engine.Actor.GetAllChildActors // (Net|NetReliableExec|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector GetActorUpVector(); // Function Engine.Actor.GetActorUpVector // (NetReliableExec|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetActorTimeDilation(); // Function Engine.Actor.GetActorTimeDilation // (Net|Exec|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	float GetActorTickInterval(); // Function Engine.Actor.GetActorTickInterval // (Exec|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector GetActorScale3D(); // Function Engine.Actor.GetActorScale3D // (Net|NetReliableNetRequest|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector GetActorRightVector(); // Function Engine.Actor.GetActorRightVector // (Net|NetRequest|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector GetActorRelativeScale3D(); // Function Engine.Actor.GetActorRelativeScale3D // (NetRequest|Native|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct FVector GetActorForwardVector(); // Function Engine.Actor.GetActorForwardVector // (Net|NetReliableNative|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void GetActorEyesViewPoint(struct FVector& OutLocation, struct FRotator& OutRotation); // Function Engine.Actor.GetActorEyesViewPoint // (Net|NetReliableNetRequest|Exec|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool GetActorEnableCollision(); // Function Engine.Actor.GetActorEnableCollision // (NetReliableNetRequest|Exec|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void GetActorBounds(bool bOnlyCollidingComponents, struct FVector& Origin, struct FVector& BoxExtent, bool bIncludeFromChildActors); // Function Engine.Actor.GetActorBounds // (Exec|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void ForceNetUpdate(); // Function Engine.Actor.ForceNetUpdate // (NetReliableNetRequest|Exec|Native|Event|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void FlushNetDormancy(); // Function Engine.Actor.FlushNetDormancy // (Exec|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void EnableInput(struct APlayerController* PlayerController); // Function Engine.Actor.EnableInput // (Net|NetRequest|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void DisableInput(struct APlayerController* PlayerController); // Function Engine.Actor.DisableInput // (Net|NetReliableNetRequest|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Delegate|NetServer|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void DetachRootComponentFromParent(bool bMaintainWorldPosition); // Function Engine.Actor.DetachRootComponentFromParent // (Net|NetReliableNetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void AddTickPrerequisiteComponent(struct UActorComponent* PrerequisiteComponent); // Function Engine.Actor.AddTickPrerequisiteComponent // (Net|NetMulticast|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	void AddTickPrerequisiteActor(struct AActor* PrerequisiteActor); // Function Engine.Actor.AddTickPrerequisiteActor // (Net|NetReliableNetRequest|Exec|Native|Event|NetResponse|Static|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	struct UActorComponent* AddComponent(struct FName TemplateName, bool bManualAttachment, struct FTransform& RelativeTransform, struct UObject* ComponentTemplateContext); // Function Engine.Actor.AddComponent // (Exec|Native|Event|NetResponse|Static|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
	bool ActorHasTag(struct FName Tag); // Function Engine.Actor.ActorHasTag // (Net|NetRequest|Native|Event|NetResponse|Static|UbergraphFunction|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a3c0
};

// Class Engine.HUD
// Size: 0x318 (Inherited: 0x228)
struct AHUD : AActor {
	struct APlayerController* PlayerOwner; // 0x228(0x08)
	char bLostFocusPaused : 1; // 0x230(0x01)
	char bShowHUD : 1; // 0x230(0x01)
	char bShowDebugInfo : 1; // 0x230(0x01)
	char pad_230_3 : 5; // 0x230(0x01)
	char pad_231[0x3]; // 0x231(0x03)
	int32_t CurrentTargetIndex; // 0x234(0x04)
	char bShowHitBoxDebugInfo : 1; // 0x238(0x01)
	char bShowOverlays : 1; // 0x238(0x01)
	char bEnableDebugTextShadow : 1; // 0x238(0x01)
	char pad_238_3 : 5; // 0x238(0x01)
	char pad_239[0x7]; // 0x239(0x07)
	struct TArray<struct AActor*> PostRenderedActors; // 0x240(0x10)
	char pad_250[0x8]; // 0x250(0x08)
	struct TArray<struct FName> DebugDisplay; // 0x258(0x10)
	struct TArray<struct FName> ToggledDebugCategories; // 0x268(0x10)
	struct UCanvas* Canvas; // 0x278(0x08)
	struct UCanvas* DebugCanvas; // 0x280(0x08)
	struct TArray<struct FDebugTextInfo> DebugTextList; // 0x288(0x10)
	struct AActor* ShowDebugTargetDesiredClass; // 0x298(0x08)
	struct AActor* ShowDebugTargetActor; // 0x2a0(0x08)
	char pad_2A8[0x70]; // 0x2a8(0x70)

	void ShowHUD(); // Function Engine.HUD.ShowHUD // (NetRequest|Native|Event|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void ShowDebugToggleSubCategory(struct FName Category); // Function Engine.HUD.ShowDebugToggleSubCategory // (Net|NetRequest|Native|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void ShowDebugForReticleTargetToggle(struct AActor* DesiredClass); // Function Engine.HUD.ShowDebugForReticleTargetToggle // (Net|NetReliableNative|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void ShowDebug(struct FName DebugType); // Function Engine.HUD.ShowDebug // (NetRequest|Exec|Event|NetResponse|Static|UbergraphFunction|Private|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void RemoveDebugText(struct AActor* SrcActor, bool bLeaveDurationText); // Function Engine.HUD.RemoveDebugText // (Net|NetRequest|Exec|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void RemoveAllDebugStrings(); // Function Engine.HUD.RemoveAllDebugStrings // (NetRequest|Exec|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void ReceiveHitBoxRelease(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxRelease // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void ReceiveHitBoxEndCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxEndCursorOver // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void ReceiveHitBoxClick(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxClick // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void ReceiveHitBoxBeginCursorOver(struct FName BoxName); // Function Engine.HUD.ReceiveHitBoxBeginCursorOver // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void ReceiveDrawHUD(int32_t SizeX, int32_t SizeY); // Function Engine.HUD.ReceiveDrawHUD // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	struct FVector Project(struct FVector Location); // Function Engine.HUD.Project // (NetReliableExec|Native|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void PreviousDebugTarget(); // Function Engine.HUD.PreviousDebugTarget // (NetReliableNetRequest|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void NextDebugTarget(); // Function Engine.HUD.NextDebugTarget // (NetReliableExec|Native|NetResponse|Static|UbergraphFunction|Protected|Delegate|NetServer|HasOutParms|HasDefaults|NetClient|DLLImport|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void GetTextSize(struct FString Text, float& OutWidth, float& OutHeight, struct UFont* Font, float Scale); // Function Engine.HUD.GetTextSize // (Net|NetReliableNetRequest|Exec|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	struct APlayerController* GetOwningPlayerController(); // Function Engine.HUD.GetOwningPlayerController // (Exec|Native|Event|NetResponse|Static|NetMulticast|MulticastDelegate|Public|Private|Protected|Delegate|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	struct APawn* GetOwningPawn(); // Function Engine.HUD.GetOwningPawn // (NetReliableNetRequest|Exec|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void GetActorsInSelectionRectangle(struct AActor* ClassFilter, struct FVector2D& FirstPoint, struct FVector2D& SecondPoint, struct TArray<struct AActor*>& OutActors, bool bIncludeNonCollidingComponents, bool bActorMustBeFullyEnclosed); // Function Engine.HUD.GetActorsInSelectionRectangle // (NetReliableNetRequest|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void DrawTextureSimple(struct UTexture* Texture, float ScreenX, float ScreenY, float Scale, bool bScalePosition); // Function Engine.HUD.DrawTextureSimple // (Net|NetReliableNetRequest|Exec|Native|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void DrawTexture(struct UTexture* Texture, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float TextureU, float TextureV, float TextureUWidth, float TextureVHeight, struct FLinearColor TintColor, enum class EBlendMode BlendMode, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawTexture // (Net|NetReliableNetRequest|Exec|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void DrawText(struct FString Text, struct FLinearColor TextColor, float ScreenX, float ScreenY, struct UFont* Font, float Scale, bool bScalePosition); // Function Engine.HUD.DrawText // (NetReliableNetRequest|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void DrawRect(struct FLinearColor RectColor, float ScreenX, float ScreenY, float ScreenW, float ScreenH); // Function Engine.HUD.DrawRect // (Event|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void DrawMaterialTriangle(struct UMaterialInterface* Material, struct FVector2D V0_Pos, struct FVector2D V1_Pos, struct FVector2D V2_Pos, struct FVector2D V0_UV, struct FVector2D V1_UV, struct FVector2D V2_UV, struct FLinearColor V0_Color, struct FLinearColor V1_Color, struct FLinearColor V2_Color); // Function Engine.HUD.DrawMaterialTriangle // (Net|NetRequest|Native|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void DrawMaterialSimple(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float Scale, bool bScalePosition); // Function Engine.HUD.DrawMaterialSimple // (Net|NetRequest|Exec|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void DrawMaterial(struct UMaterialInterface* Material, float ScreenX, float ScreenY, float ScreenW, float ScreenH, float MaterialU, float MaterialV, float MaterialUWidth, float MaterialVHeight, float Scale, bool bScalePosition, float Rotation, struct FVector2D RotPivot); // Function Engine.HUD.DrawMaterial // (NetReliableNetRequest|Exec|Native|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void DrawLine(float StartScreenX, float StartScreenY, float EndScreenX, float EndScreenY, struct FLinearColor LineColor, float LineThickness); // Function Engine.HUD.DrawLine // (Net|NetReliableNetRequest|Native|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void Deproject(float ScreenX, float ScreenY, struct FVector& WorldPosition, struct FVector& WorldDirection); // Function Engine.HUD.Deproject // (Net|Native|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void AddHitBox(struct FVector2D Position, struct FVector2D Size, struct FName InName, bool bConsumesInput, int32_t Priority); // Function Engine.HUD.AddHitBox // (Net|NetRequest|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
	void AddDebugText(struct FString DebugText, struct AActor* SrcActor, float Duration, struct FVector Offset, struct FVector DesiredOffset, struct FColor TextColor, bool bSkipOverwriteCheck, bool bAbsoluteLocation, bool bKeepAttachedToActor, struct UFont* InFont, float FontScale, bool bDrawShadow); // Function Engine.HUD.AddDebugText // (Net|NetReliableNetRequest|Native|NetResponse|Static|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8a600
};

// Class Engine.Pawn
// Size: 0x288 (Inherited: 0x228)
struct APawn : AActor {
	char pad_228[0x8]; // 0x228(0x08)
	char bUseControllerRotationPitch : 1; // 0x230(0x01)
	char bUseControllerRotationYaw : 1; // 0x230(0x01)
	char bUseControllerRotationRoll : 1; // 0x230(0x01)
	char bCanAffectNavigationGeneration : 1; // 0x230(0x01)
	char pad_230_4 : 4; // 0x230(0x01)
	char pad_231[0x3]; // 0x231(0x03)
	float BaseEyeHeight; // 0x234(0x04)
	enum class EAutoReceiveInput AutoPossessPlayer; // 0x238(0x01)
	enum class EAutoPossessAI AutoPossessAI; // 0x239(0x01)
	char RemoteViewPitch; // 0x23a(0x01)
	char pad_23B[0x5]; // 0x23b(0x05)
	struct AController* AIControllerClass; // 0x240(0x08)
	struct APlayerState* PlayerState; // 0x248(0x08)
	char pad_250[0x8]; // 0x250(0x08)
	struct AController* LastHitBy; // 0x258(0x08)
	struct AController* Controller; // 0x260(0x08)
	char pad_268[0x4]; // 0x268(0x04)
	struct FVector ControlInputVector; // 0x26c(0x0c)
	struct FVector LastControlInputVector; // 0x278(0x0c)
	char pad_284[0x4]; // 0x284(0x04)

	void SpawnDefaultController(); // Function Engine.Pawn.SpawnDefaultController // (Net|NetRequest|Exec|Event|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void SetCanAffectNavigationGeneration(bool bNewValue, bool bForceUpdate); // Function Engine.Pawn.SetCanAffectNavigationGeneration // (Net|Native|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void ReceiveUnpossessed(struct AController* OldController); // Function Engine.Pawn.ReceiveUnpossessed // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void ReceivePossessed(struct AController* NewController); // Function Engine.Pawn.ReceivePossessed // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void PawnMakeNoise(float Loudness, struct FVector NoiseLocation, bool bUseNoiseMakerLocation, struct AActor* NoiseMaker); // Function Engine.Pawn.PawnMakeNoise // (NetReliableNetRequest|Exec|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void OnRep_PlayerState(); // Function Engine.Pawn.OnRep_PlayerState // (Net|NetReliableNative|Static|NetMulticast|UbergraphFunction|Public|Protected|Delegate|NetServer|HasOutParms|HasDefaults|NetClient|DLLImport|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void OnRep_Controller(); // Function Engine.Pawn.OnRep_Controller // (NetReliableNative|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void LaunchPawn(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Pawn.LaunchPawn // (Net|Exec|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct FVector K2_GetMovementInputVector(); // Function Engine.Pawn.K2_GetMovementInputVector // (Net|NetRequest|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	bool IsPlayerControlled(); // Function Engine.Pawn.IsPlayerControlled // (Net|NetReliableExec|NetResponse|UbergraphFunction|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	bool IsPawnControlled(); // Function Engine.Pawn.IsPawnControlled // (Net|Exec|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	bool IsMoveInputIgnored(); // Function Engine.Pawn.IsMoveInputIgnored // (Exec|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	bool IsLocallyControlled(); // Function Engine.Pawn.IsLocallyControlled // (Net|NetReliableNetRequest|Exec|NetMulticast|Public|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	bool IsControlled(); // Function Engine.Pawn.IsControlled // (Net|NetReliableNetRequest|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	bool IsBotControlled(); // Function Engine.Pawn.IsBotControlled // (NetReliableNetRequest|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct FVector GetPendingMovementInputVector(); // Function Engine.Pawn.GetPendingMovementInputVector // (Net|NetRequest|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct FVector GetNavAgentLocation(); // Function Engine.Pawn.GetNavAgentLocation // (Net|NetReliableNative|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct UPawnMovementComponent* GetMovementComponent(); // Function Engine.Pawn.GetMovementComponent // (Net|NetReliableNetRequest|Exec|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Protected|NetServer|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct AActor* GetMovementBaseActor(struct APawn* Pawn); // Function Engine.Pawn.GetMovementBaseActor // (Net|NetReliableNetRequest|Exec|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct FVector GetLastMovementInputVector(); // Function Engine.Pawn.GetLastMovementInputVector // (NetRequest|Exec|Static|NetMulticast|Public|Private|Protected|Delegate|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct FRotator GetControlRotation(); // Function Engine.Pawn.GetControlRotation // (Net|NetRequest|Exec|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct AController* GetController(); // Function Engine.Pawn.GetController // (NetReliableNetRequest|Exec|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct FRotator GetBaseAimRotation(); // Function Engine.Pawn.GetBaseAimRotation // (NetReliableNetRequest|Exec|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void DetachFromControllerPendingDestroy(); // Function Engine.Pawn.DetachFromControllerPendingDestroy // (NetReliableNetRequest|Native|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	struct FVector ConsumeMovementInputVector(); // Function Engine.Pawn.ConsumeMovementInputVector // (Net|NetReliableNetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void AddMovementInput(struct FVector WorldDirection, float ScaleValue, bool bForce); // Function Engine.Pawn.AddMovementInput // (Net|Exec|Native|Event|NetResponse|Static|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void AddControllerYawInput(float val); // Function Engine.Pawn.AddControllerYawInput // (Net|NetReliableNetRequest|Native|Event|NetResponse|Static|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void AddControllerRollInput(float val); // Function Engine.Pawn.AddControllerRollInput // (Net|NetRequest|Native|Event|NetResponse|Static|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
	void AddControllerPitchInput(float val); // Function Engine.Pawn.AddControllerPitchInput // (Net|NetReliableNative|Event|NetResponse|Static|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db88f80
};

// Class Engine.DefaultPawn
// Size: 0x2b0 (Inherited: 0x288)
struct ADefaultPawn : APawn {
	float BaseTurnRate; // 0x288(0x04)
	float BaseLookUpRate; // 0x28c(0x04)
	struct UPawnMovementComponent* MovementComponent; // 0x290(0x08)
	struct USphereComponent* CollisionComponent; // 0x298(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x2a0(0x08)
	char bAddDefaultMovementBindings : 1; // 0x2a8(0x01)
	char pad_2A8_1 : 7; // 0x2a8(0x01)
	char pad_2A9[0x7]; // 0x2a9(0x07)

	void TurnAtRate(float Rate); // Function Engine.DefaultPawn.TurnAtRate // (Exec|Event|NetResponse|NetMulticast|MulticastDelegate|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db8f940
	void MoveUp_World(float val); // Function Engine.DefaultPawn.MoveUp_World // (Net|NetReliableNative|NetResponse|NetMulticast|MulticastDelegate|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db891c0
	void MoveRight(float val); // Function Engine.DefaultPawn.MoveRight // (Net|Native|NetResponse|NetMulticast|MulticastDelegate|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db891c0
	void MoveForward(float val); // Function Engine.DefaultPawn.MoveForward // (Net|NetReliableNetRequest|Exec|NetResponse|NetMulticast|MulticastDelegate|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db891c0
	void LookUpAtRate(float Rate); // Function Engine.DefaultPawn.LookUpAtRate // (Net|NetRequest|Exec|NetResponse|NetMulticast|MulticastDelegate|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f2db891c0
};

// Class Engine.BlueprintCore
// Size: 0x50 (Inherited: 0x28)
struct UBlueprintCore : UObject {
	struct UObject* SkeletonGeneratedClass; // 0x28(0x08)
	struct UObject* GeneratedClass; // 0x30(0x08)
	bool bLegacyNeedToPurgeSkelRefs; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	struct FGuid BlueprintGuid; // 0x3c(0x10)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class Engine.Blueprint
// Size: 0xa0 (Inherited: 0x50)
struct UBlueprint : UBlueprintCore {
	struct UObject* ParentClass; // 0x50(0x08)
	enum class EBlueprintType BlueprintType; // 0x58(0x01)
	char bRecompileOnLoad : 1; // 0x59(0x01)
	char bHasBeenRegenerated : 1; // 0x59(0x01)
	char bIsRegeneratingOnLoad : 1; // 0x59(0x01)
	char pad_59_3 : 5; // 0x59(0x01)
	char pad_5A[0x2]; // 0x5a(0x02)
	int32_t BlueprintSystemVersion; // 0x5c(0x04)
	struct USimpleConstructionScript* SimpleConstructionScript; // 0x60(0x08)
	struct TArray<struct UActorComponent*> ComponentTemplates; // 0x68(0x10)
	struct TArray<struct UTimelineTemplate*> Timelines; // 0x78(0x10)
	struct TArray<struct FBPComponentClassOverride> ComponentClassOverrides; // 0x88(0x10)
	struct UInheritableComponentHandler* InheritableComponentHandler; // 0x98(0x08)
};

// Class Engine.DataAsset
// Size: 0x30 (Inherited: 0x28)
struct UDataAsset : UObject {
	struct UDataAsset* NativeClass; // 0x28(0x08)
};

// Class Engine.ReplicationDriver
// Size: 0x28 (Inherited: 0x28)
struct UReplicationDriver : UObject {
};

// Class Engine.ReplicationConnectionDriver
// Size: 0x28 (Inherited: 0x28)
struct UReplicationConnectionDriver : UObject {
};

// Class Engine.FXSystemComponent
// Size: 0x540 (Inherited: 0x540)
struct UFXSystemComponent : UPrimitiveComponent {

	void SetVectorParameter(struct FName ParameterName, struct FVector Param); // Function Engine.FXSystemComponent.SetVectorParameter // (NetReliableExec|Static|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetUseAutoManageAttachment(bool bAutoManage); // Function Engine.FXSystemComponent.SetUseAutoManageAttachment // (Exec|Static|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	void SetFloatParameter(struct FName ParameterName, float Param); // Function Engine.FXSystemComponent.SetFloatParameter // (Net|NetReliableExec|Native|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	void SetEmitterEnable(struct FName EmitterName, bool bNewEnableState); // Function Engine.FXSystemComponent.SetEmitterEnable // (Net|NetReliableNetRequest|Native|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	void SetColorParameter(struct FName ParameterName, struct FLinearColor Param); // Function Engine.FXSystemComponent.SetColorParameter // (NetRequest|Native|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	void SetBoolParameter(struct FName ParameterName, bool Param); // Function Engine.FXSystemComponent.SetBoolParameter // (NetReliableNetRequest|Exec|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	void SetAutoAttachmentParameters(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule); // Function Engine.FXSystemComponent.SetAutoAttachmentParameters // (Net|NetReliableExec|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	void SetActorParameter(struct FName ParameterName, struct AActor* Param); // Function Engine.FXSystemComponent.SetActorParameter // (NetRequest|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	void ReleaseToPool(); // Function Engine.FXSystemComponent.ReleaseToPool // (Net|NetRequest|Exec|Native|Event|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
	struct UFXSystemAsset* GetFXSystemAsset(); // Function Engine.FXSystemComponent.GetFXSystemAsset // (NetReliableNetRequest|Exec|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c580
};

// Class Engine.ParticleSystemComponent
// Size: 0x7b0 (Inherited: 0x540)
struct UParticleSystemComponent : UFXSystemComponent {
	struct UParticleSystem* Template; // 0x540(0x08)
	struct TArray<struct UMaterialInterface*> EmitterMaterials; // 0x548(0x10)
	struct TArray<struct USkeletalMeshComponent*> SkelMeshComponents; // 0x558(0x10)
	char pad_568[0x1]; // 0x568(0x01)
	char bResetOnDetach : 1; // 0x569(0x01)
	char bUpdateOnDedicatedServer : 1; // 0x569(0x01)
	char pad_569_2 : 2; // 0x569(0x01)
	char bAllowRecycling : 1; // 0x569(0x01)
	char bAutoManageAttachment : 1; // 0x569(0x01)
	char bAutoAttachWeldSimulatedBodies : 1; // 0x569(0x01)
	char pad_569_7 : 1; // 0x569(0x01)
	char pad_56A_0 : 1; // 0x56a(0x01)
	char bWarmingUp : 1; // 0x56a(0x01)
	char bOverrideLODMethod : 1; // 0x56a(0x01)
	char bSkipUpdateDynamicDataDuringTick : 1; // 0x56a(0x01)
	char pad_56A_4 : 4; // 0x56a(0x01)
	char pad_56B[0xa]; // 0x56b(0x0a)
	enum class ParticleSystemLODMethod LODMethod; // 0x575(0x01)
	enum class EParticleSignificanceLevel RequiredSignificance; // 0x576(0x01)
	char pad_577[0x1]; // 0x577(0x01)
	struct TArray<struct FParticleSysParam> InstanceParameters; // 0x578(0x10)
	struct FMulticastInlineDelegate OnParticleSpawn; // 0x588(0x10)
	struct FMulticastInlineDelegate OnParticleBurst; // 0x598(0x10)
	struct FMulticastInlineDelegate OnParticleDeath; // 0x5a8(0x10)
	struct FMulticastInlineDelegate OnParticleCollide; // 0x5b8(0x10)
	bool bOldPositionValid; // 0x5c8(0x01)
	char pad_5C9[0x3]; // 0x5c9(0x03)
	struct FVector OldPosition; // 0x5cc(0x0c)
	struct FVector PartSysVelocity; // 0x5d8(0x0c)
	float WarmupTime; // 0x5e4(0x04)
	float WarmupTickRate; // 0x5e8(0x04)
	char pad_5EC[0x4]; // 0x5ec(0x04)
	float SecondsBeforeInactive; // 0x5f0(0x04)
	char pad_5F4[0x4]; // 0x5f4(0x04)
	float MaxTimeBeforeForceUpdateTransform; // 0x5f8(0x04)
	char pad_5FC[0x1c]; // 0x5fc(0x1c)
	struct TArray<struct UParticleSystemReplay*> ReplayClips; // 0x618(0x10)
	char pad_628[0x8]; // 0x628(0x08)
	float CustomTimeDilation; // 0x630(0x04)
	char pad_634[0x54]; // 0x634(0x54)
	struct TWeakObjectPtr<struct USceneComponent> AutoAttachParent; // 0x688(0x08)
	struct FName AutoAttachSocketName; // 0x690(0x08)
	enum class EAttachmentRule AutoAttachLocationRule; // 0x698(0x01)
	enum class EAttachmentRule AutoAttachRotationRule; // 0x699(0x01)
	enum class EAttachmentRule AutoAttachScaleRule; // 0x69a(0x01)
	char pad_69B[0x2d]; // 0x69b(0x2d)
	struct FMulticastInlineDelegate OnSystemFinished; // 0x6c8(0x10)
	struct FMulticastInlineDelegate OnPreSystemActivated; // 0x6d8(0x10)
	char pad_6E8[0xc8]; // 0x6e8(0xc8)

	void SetTrailSourceData(struct FName InFirstSocketName, struct FName InSecondSocketName, enum class ETrailWidthMode InWidthMode, float InWidth); // Function Engine.ParticleSystemComponent.SetTrailSourceData // (Net|NetReliableStatic|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144b800
	void SetTemplate(struct UParticleSystem* NewTemplate); // Function Engine.ParticleSystemComponent.SetTemplate // (Net|Static|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetMaterialParameter(struct FName ParameterName, struct UMaterialInterface* Param); // Function Engine.ParticleSystemComponent.SetMaterialParameter // (NetReliableNetRequest|Exec|Native|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetBeamTargetTangent(int32_t EmitterIndex, struct FVector NewTangentPoint, int32_t TargetIndex); // Function Engine.ParticleSystemComponent.SetBeamTargetTangent // (Net|Exec|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetBeamTargetStrength(int32_t EmitterIndex, float NewTargetStrength, int32_t TargetIndex); // Function Engine.ParticleSystemComponent.SetBeamTargetStrength // (Net|NetRequest|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetBeamTargetPoint(int32_t EmitterIndex, struct FVector NewTargetPoint, int32_t TargetIndex); // Function Engine.ParticleSystemComponent.SetBeamTargetPoint // (Net|Event|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetBeamSourceTangent(int32_t EmitterIndex, struct FVector NewTangentPoint, int32_t SourceIndex); // Function Engine.ParticleSystemComponent.SetBeamSourceTangent // (Net|NetRequest|Exec|Native|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetBeamSourceStrength(int32_t EmitterIndex, float NewSourceStrength, int32_t SourceIndex); // Function Engine.ParticleSystemComponent.SetBeamSourceStrength // (Net|Exec|Native|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetBeamSourcePoint(int32_t EmitterIndex, struct FVector NewSourcePoint, int32_t SourceIndex); // Function Engine.ParticleSystemComponent.SetBeamSourcePoint // (Net|NetRequest|Native|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetBeamEndPoint(int32_t EmitterIndex, struct FVector NewEndPoint); // Function Engine.ParticleSystemComponent.SetBeamEndPoint // (Net|Native|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void SetAutoAttachParams(struct USceneComponent* Parent, struct FName SocketName, enum class EAttachLocation LocationType); // Function Engine.ParticleSystemComponent.SetAutoAttachParams // (Net|NetReliableNetRequest|NetResponse|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	int32_t GetNumActiveParticles(); // Function Engine.ParticleSystemComponent.GetNumActiveParticles // (Net|NetRequest|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	struct UMaterialInterface* GetNamedMaterial(struct FName InName); // Function Engine.ParticleSystemComponent.GetNamedMaterial // (Net|Native|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	bool GetBeamTargetTangent(int32_t EmitterIndex, int32_t TargetIndex, struct FVector& OutTangentPoint); // Function Engine.ParticleSystemComponent.GetBeamTargetTangent // (Exec|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	bool GetBeamTargetStrength(int32_t EmitterIndex, int32_t TargetIndex, float& OutTargetStrength); // Function Engine.ParticleSystemComponent.GetBeamTargetStrength // (NetRequest|Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	bool GetBeamTargetPoint(int32_t EmitterIndex, int32_t TargetIndex, struct FVector& OutTargetPoint); // Function Engine.ParticleSystemComponent.GetBeamTargetPoint // (Event|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	bool GetBeamSourceTangent(int32_t EmitterIndex, int32_t SourceIndex, struct FVector& OutTangentPoint); // Function Engine.ParticleSystemComponent.GetBeamSourceTangent // (Net|NetReliableExec|Native|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	bool GetBeamSourceStrength(int32_t EmitterIndex, int32_t SourceIndex, float& OutSourceStrength); // Function Engine.ParticleSystemComponent.GetBeamSourceStrength // (Net|NetReliableNetRequest|Native|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	bool GetBeamSourcePoint(int32_t EmitterIndex, int32_t SourceIndex, struct FVector& OutSourcePoint); // Function Engine.ParticleSystemComponent.GetBeamSourcePoint // (Net|NetReliableNative|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	bool GetBeamEndPoint(int32_t EmitterIndex, struct FVector& OutEndPoint); // Function Engine.ParticleSystemComponent.GetBeamEndPoint // (Net|NetReliableNetRequest|Exec|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void GenerateParticleEvent(struct FName InEventName, float InEmitterTime, struct FVector InLocation, struct FVector InDirection, struct FVector InVelocity); // Function Engine.ParticleSystemComponent.GenerateParticleEvent // (Net|NetReliableNetRequest|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void EndTrails(); // Function Engine.ParticleSystemComponent.EndTrails // (Net|NetReliableNetRequest|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	struct UMaterialInstanceDynamic* CreateNamedDynamicMaterialInstance(struct FName InName, struct UMaterialInterface* SourceMaterial); // Function Engine.ParticleSystemComponent.CreateNamedDynamicMaterialInstance // (NetRequest|NetMulticast|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
	void BeginTrails(struct FName InFirstSocketName, struct FName InSecondSocketName, enum class ETrailWidthMode InWidthMode, float InWidth); // Function Engine.ParticleSystemComponent.BeginTrails // (Net|NetRequest|Exec|Native|Event|NetResponse|Static|MulticastDelegate|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144c7c0
};

// Class Engine.GameInstance
// Size: 0x1a0 (Inherited: 0x28)
struct UGameInstance : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct ULocalPlayer*> LocalPlayers; // 0x38(0x10)
	struct UOnlineSession* OnlineSession; // 0x48(0x08)
	struct TArray<struct UObject*> ReferencedObjects; // 0x50(0x10)
	char pad_60[0x140]; // 0x60(0x140)

	void ReceiveShutdown(); // Function Engine.GameInstance.ReceiveShutdown // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3171ebc0
	void ReceiveInit(); // Function Engine.GameInstance.ReceiveInit // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144b5c0
	void HandleTravelError(enum class ETravelFailure FailureType); // Function Engine.GameInstance.HandleTravelError // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void HandleNetworkError(enum class ENetworkFailure FailureType, bool bIsServer); // Function Engine.GameInstance.HandleNetworkError // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void DebugRemovePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugRemovePlayer // (NetReliableNetRequest|Exec|Native|Event|UbergraphFunction|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144b5c0
	void DebugCreatePlayer(int32_t ControllerId); // Function Engine.GameInstance.DebugCreatePlayer // (Net|NetReliableExec|Native|Event|UbergraphFunction|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3144b5c0
};

// Class Engine.Subsystem
// Size: 0x30 (Inherited: 0x28)
struct USubsystem : UObject {
	char pad_28[0x8]; // 0x28(0x08)
};

// Class Engine.GameInstanceSubsystem
// Size: 0x30 (Inherited: 0x30)
struct UGameInstanceSubsystem : USubsystem {
};

// Class Engine.AnimNotifyState
// Size: 0x30 (Inherited: 0x28)
struct UAnimNotifyState : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	bool Received_NotifyTick(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float FrameDeltaTime); // Function Engine.AnimNotifyState.Received_NotifyTick // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f31455500
	bool Received_NotifyEnd(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Engine.AnimNotifyState.Received_NotifyEnd // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314552c0
	bool Received_NotifyBegin(struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation, float TotalDuration); // Function Engine.AnimNotifyState.Received_NotifyBegin // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314552c0
	struct FString GetNotifyName(); // Function Engine.AnimNotifyState.GetNotifyName // (Net|NetReliableNative|Event|NetResponse|Static|MulticastDelegate|Private|NetServer|HasDefaults|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314552c0
};

// Class Engine.AssetImportData
// Size: 0x28 (Inherited: 0x28)
struct UAssetImportData : UObject {
};

// Class Engine.AssetUserData
// Size: 0x28 (Inherited: 0x28)
struct UAssetUserData : UObject {
};

// Class Engine.DeveloperSettings
// Size: 0x38 (Inherited: 0x28)
struct UDeveloperSettings : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.Player
// Size: 0x48 (Inherited: 0x28)
struct UPlayer : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct APlayerController* PlayerController; // 0x30(0x08)
	int32_t CurrentNetSpeed; // 0x38(0x04)
	int32_t ConfiguredInternetSpeed; // 0x3c(0x04)
	int32_t ConfiguredLanSpeed; // 0x40(0x04)
	char pad_44[0x4]; // 0x44(0x04)
};

// Class Engine.NetConnection
// Size: 0x1b08 (Inherited: 0x48)
struct UNetConnection : UPlayer {
	struct TArray<struct UChildConnection*> Children; // 0x48(0x10)
	struct UNetDriver* Driver; // 0x58(0x08)
	struct UPackageMap* PackageMapClass; // 0x60(0x08)
	struct UPackageMap* PackageMap; // 0x68(0x08)
	struct TArray<struct UChannel*> OpenChannels; // 0x70(0x10)
	struct TArray<struct AActor*> SentTemporaries; // 0x80(0x10)
	struct AActor* ViewTarget; // 0x90(0x08)
	struct AActor* OwningActor; // 0x98(0x08)
	int32_t MaxPacket; // 0xa0(0x04)
	char InternalAck : 1; // 0xa4(0x01)
	char pad_A4_1 : 7; // 0xa4(0x01)
	char pad_A5[0xc3]; // 0xa5(0xc3)
	struct FUniqueNetIdRepl PlayerId; // 0x168(0x28)
	char pad_190[0x58]; // 0x190(0x58)
	double LastReceiveTime; // 0x1e8(0x08)
	char pad_1F0[0x1338]; // 0x1f0(0x1338)
	struct TArray<struct UChannel*> ChannelsToTick; // 0x1528(0x10)
	char pad_1538[0x5d0]; // 0x1538(0x5d0)
};

// Class Engine.NetDriver
// Size: 0x758 (Inherited: 0x28)
struct UNetDriver : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct FString NetConnectionClassName; // 0x30(0x10)
	struct FString ReplicationDriverClassName; // 0x40(0x10)
	int32_t MaxDownloadSize; // 0x50(0x04)
	char bClampListenServerTickRate : 1; // 0x54(0x01)
	char pad_54_1 : 7; // 0x54(0x01)
	char pad_55[0x3]; // 0x55(0x03)
	int32_t NetServerMaxTickRate; // 0x58(0x04)
	int32_t MaxNetTickRate; // 0x5c(0x04)
	int32_t MaxInternetClientRate; // 0x60(0x04)
	int32_t MaxClientRate; // 0x64(0x04)
	float ServerTravelPause; // 0x68(0x04)
	float SpawnPrioritySeconds; // 0x6c(0x04)
	float RelevantTimeout; // 0x70(0x04)
	float KeepAliveTime; // 0x74(0x04)
	float InitialConnectTimeout; // 0x78(0x04)
	float ConnectionTimeout; // 0x7c(0x04)
	float TimeoutMultiplierForUnoptimizedBuilds; // 0x80(0x04)
	char pad_84[0x1]; // 0x84(0x01)
	bool bNoTimeouts; // 0x85(0x01)
	bool bNeverApplyNetworkEmulationSettings; // 0x86(0x01)
	char pad_87[0x1]; // 0x87(0x01)
	struct UNetConnection* ServerConnection; // 0x88(0x08)
	struct TArray<struct UNetConnection*> ClientConnections; // 0x90(0x10)
	char pad_A0[0x60]; // 0xa0(0x60)
	int32_t RecentlyDisconnectedTrackingTime; // 0x100(0x04)
	char pad_104[0x3c]; // 0x104(0x3c)
	struct UWorld* World; // 0x140(0x08)
	struct UPackage* WorldPackage; // 0x148(0x08)
	char pad_150[0x20]; // 0x150(0x20)
	struct UObject* NetConnectionClass; // 0x170(0x08)
	struct UObject* ReplicationDriverClass; // 0x178(0x08)
	char pad_180[0x10]; // 0x180(0x10)
	struct FName NetDriverName; // 0x190(0x08)
	struct TArray<struct FChannelDefinition> ChannelDefinitions; // 0x198(0x10)
	struct TMap<struct FName, struct FChannelDefinition> ChannelDefinitionMap; // 0x1a8(0x50)
	struct TArray<struct UChannel*> ActorChannelPool; // 0x1f8(0x10)
	char pad_208[0x8]; // 0x208(0x08)
	float Time; // 0x210(0x04)
	char pad_214[0x4e4]; // 0x214(0x4e4)
	struct UReplicationDriver* ReplicationDriver; // 0x6f8(0x08)
	char pad_700[0x58]; // 0x700(0x58)
};

// Class Engine.BlueprintAsyncActionBase
// Size: 0x30 (Inherited: 0x28)
struct UBlueprintAsyncActionBase : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	void Activate(); // Function Engine.BlueprintAsyncActionBase.Activate // (Net|Exec|Native|Event|Static|NetMulticast|MulticastDelegate|Public|Private|Protected|Delegate|NetServer|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f3146dc00
};

// Class Engine.OnlineBlueprintCallProxyBase
// Size: 0x30 (Inherited: 0x30)
struct UOnlineBlueprintCallProxyBase : UBlueprintAsyncActionBase {
};

// Class Engine.OnlineEngineInterface
// Size: 0x28 (Inherited: 0x28)
struct UOnlineEngineInterface : UObject {
};

// Class Engine.OnlineSession
// Size: 0x28 (Inherited: 0x28)
struct UOnlineSession : UObject {
};

// Class Engine.Engine
// Size: 0xe10 (Inherited: 0x28)
struct UEngine : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct UFont* TinyFont; // 0x30(0x08)
	struct FSoftObjectPath TinyFontName; // 0x38(0x18)
	struct UFont* SmallFont; // 0x50(0x08)
	struct FSoftObjectPath SmallFontName; // 0x58(0x18)
	struct UFont* MediumFont; // 0x70(0x08)
	struct FSoftObjectPath MediumFontName; // 0x78(0x18)
	struct UFont* LargeFont; // 0x90(0x08)
	struct FSoftObjectPath LargeFontName; // 0x98(0x18)
	struct UFont* SubtitleFont; // 0xb0(0x08)
	struct FSoftObjectPath SubtitleFontName; // 0xb8(0x18)
	struct TArray<struct UFont*> AdditionalFonts; // 0xd0(0x10)
	char pad_E0[0x8]; // 0xe0(0x08)
	struct TArray<struct FString> AdditionalFontNames; // 0xe8(0x10)
	struct UConsole* ConsoleClass; // 0xf8(0x08)
	struct FSoftClassPath ConsoleClassName; // 0x100(0x18)
	struct UGameViewportClient* GameViewportClientClass; // 0x118(0x08)
	struct FSoftClassPath GameViewportClientClassName; // 0x120(0x18)
	struct ULocalPlayer* LocalPlayerClass; // 0x138(0x08)
	struct FSoftClassPath LocalPlayerClassName; // 0x140(0x18)
	struct AWorldSettings* WorldSettingsClass; // 0x158(0x08)
	struct FSoftClassPath WorldSettingsClassName; // 0x160(0x18)
	struct FSoftClassPath NavigationSystemClassName; // 0x178(0x18)
	struct UNavigationSystemBase* NavigationSystemClass; // 0x190(0x08)
	struct FSoftClassPath NavigationSystemConfigClassName; // 0x198(0x18)
	struct UNavigationSystemConfig* NavigationSystemConfigClass; // 0x1b0(0x08)
	struct FSoftClassPath AvoidanceManagerClassName; // 0x1b8(0x18)
	struct UAvoidanceManager* AvoidanceManagerClass; // 0x1d0(0x08)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandlerClass; // 0x1d8(0x08)
	struct FSoftClassPath PhysicsCollisionHandlerClassName; // 0x1e0(0x18)
	struct FSoftClassPath GameUserSettingsClassName; // 0x1f8(0x18)
	struct UGameUserSettings* GameUserSettingsClass; // 0x210(0x08)
	struct FSoftClassPath AIControllerClassName; // 0x218(0x18)
	struct UGameUserSettings* GameUserSettings; // 0x230(0x08)
	struct ALevelScriptActor* LevelScriptActorClass; // 0x238(0x08)
	struct FSoftClassPath LevelScriptActorClassName; // 0x240(0x18)
	struct FSoftClassPath DefaultBlueprintBaseClassName; // 0x258(0x18)
	struct FSoftClassPath GameSingletonClassName; // 0x270(0x18)
	struct UObject* GameSingleton; // 0x288(0x08)
	struct FSoftClassPath AssetManagerClassName; // 0x290(0x18)
	struct UAssetManager* AssetManager; // 0x2a8(0x08)
	struct FSoftClassPath RuntimeAssetsCollectionClassName; // 0x2b0(0x18)
	struct URuntimeAssetsCollectionBase* RuntimeAssetsCollection; // 0x2c8(0x08)
	struct UTexture2D* DefaultTexture; // 0x2d0(0x08)
	struct FSoftObjectPath DefaultTextureName; // 0x2d8(0x18)
	struct UTexture* DefaultDiffuseTexture; // 0x2f0(0x08)
	struct FSoftObjectPath DefaultDiffuseTextureName; // 0x2f8(0x18)
	struct UTexture2D* DefaultBSPVertexTexture; // 0x310(0x08)
	struct FSoftObjectPath DefaultBSPVertexTextureName; // 0x318(0x18)
	struct UTexture2D* HighFrequencyNoiseTexture; // 0x330(0x08)
	struct FSoftObjectPath HighFrequencyNoiseTextureName; // 0x338(0x18)
	struct UTexture2D* DefaultBokehTexture; // 0x350(0x08)
	struct FSoftObjectPath DefaultBokehTextureName; // 0x358(0x18)
	struct UTexture2D* DefaultBloomKernelTexture; // 0x370(0x08)
	struct FSoftObjectPath DefaultBloomKernelTextureName; // 0x378(0x18)
	struct UMaterial* WireframeMaterial; // 0x390(0x08)
	struct FString WireframeMaterialName; // 0x398(0x10)
	struct UMaterial* DebugMeshMaterial; // 0x3a8(0x08)
	struct FSoftObjectPath DebugMeshMaterialName; // 0x3b0(0x18)
	struct UMaterial* EmissiveMeshMaterial; // 0x3c8(0x08)
	struct FSoftObjectPath EmissiveMeshMaterialName; // 0x3d0(0x18)
	struct UMaterial* LevelColorationLitMaterial; // 0x3e8(0x08)
	struct FString LevelColorationLitMaterialName; // 0x3f0(0x10)
	struct UMaterial* LevelColorationUnlitMaterial; // 0x400(0x08)
	struct FString LevelColorationUnlitMaterialName; // 0x408(0x10)
	struct UMaterial* LightingTexelDensityMaterial; // 0x418(0x08)
	struct FString LightingTexelDensityName; // 0x420(0x10)
	struct UMaterial* ShadedLevelColorationLitMaterial; // 0x430(0x08)
	struct FString ShadedLevelColorationLitMaterialName; // 0x438(0x10)
	struct UMaterial* ShadedLevelColorationUnlitMaterial; // 0x448(0x08)
	struct FString ShadedLevelColorationUnlitMaterialName; // 0x450(0x10)
	struct UMaterial* RemoveSurfaceMaterial; // 0x460(0x08)
	struct FSoftObjectPath RemoveSurfaceMaterialName; // 0x468(0x18)
	struct UMaterial* VertexColorMaterial; // 0x480(0x08)
	struct FString VertexColorMaterialName; // 0x488(0x10)
	struct UMaterial* VertexColorViewModeMaterial_ColorOnly; // 0x498(0x08)
	struct FString VertexColorViewModeMaterialName_ColorOnly; // 0x4a0(0x10)
	struct UMaterial* VertexColorViewModeMaterial_AlphaAsColor; // 0x4b0(0x08)
	struct FString VertexColorViewModeMaterialName_AlphaAsColor; // 0x4b8(0x10)
	struct UMaterial* VertexColorViewModeMaterial_RedOnly; // 0x4c8(0x08)
	struct FString VertexColorViewModeMaterialName_RedOnly; // 0x4d0(0x10)
	struct UMaterial* VertexColorViewModeMaterial_GreenOnly; // 0x4e0(0x08)
	struct FString VertexColorViewModeMaterialName_GreenOnly; // 0x4e8(0x10)
	struct UMaterial* VertexColorViewModeMaterial_BlueOnly; // 0x4f8(0x08)
	struct FString VertexColorViewModeMaterialName_BlueOnly; // 0x500(0x10)
	struct FSoftObjectPath DebugEditorMaterialName; // 0x510(0x18)
	struct UMaterial* ConstraintLimitMaterial; // 0x528(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialX; // 0x530(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialXAxis; // 0x538(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialY; // 0x540(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialYAxis; // 0x548(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZ; // 0x550(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialZAxis; // 0x558(0x08)
	struct UMaterialInstanceDynamic* ConstraintLimitMaterialPrismatic; // 0x560(0x08)
	struct UMaterial* InvalidLightmapSettingsMaterial; // 0x568(0x08)
	struct FSoftObjectPath InvalidLightmapSettingsMaterialName; // 0x570(0x18)
	struct UMaterial* PreviewShadowsIndicatorMaterial; // 0x588(0x08)
	struct FSoftObjectPath PreviewShadowsIndicatorMaterialName; // 0x590(0x18)
	struct UMaterial* ArrowMaterial; // 0x5a8(0x08)
	struct UMaterialInstanceDynamic* ArrowMaterialYellow; // 0x5b0(0x08)
	struct FSoftObjectPath ArrowMaterialName; // 0x5b8(0x18)
	struct FLinearColor LightingOnlyBrightness; // 0x5d0(0x10)
	struct TArray<struct FLinearColor> ShaderComplexityColors; // 0x5e0(0x10)
	struct TArray<struct FLinearColor> QuadComplexityColors; // 0x5f0(0x10)
	struct TArray<struct FLinearColor> LightComplexityColors; // 0x600(0x10)
	struct TArray<struct FLinearColor> StationaryLightOverlapColors; // 0x610(0x10)
	struct TArray<struct FLinearColor> LODColorationColors; // 0x620(0x10)
	struct TArray<struct FLinearColor> HLODColorationColors; // 0x630(0x10)
	struct TArray<struct FLinearColor> StreamingAccuracyColors; // 0x640(0x10)
	float MaxPixelShaderAdditiveComplexityCount; // 0x650(0x04)
	float MaxES3PixelShaderAdditiveComplexityCount; // 0x654(0x04)
	float MinLightMapDensity; // 0x658(0x04)
	float IdealLightMapDensity; // 0x65c(0x04)
	float MaxLightMapDensity; // 0x660(0x04)
	char bRenderLightMapDensityGrayscale : 1; // 0x664(0x01)
	char pad_664_1 : 7; // 0x664(0x01)
	char pad_665[0x3]; // 0x665(0x03)
	float RenderLightMapDensityGrayscaleScale; // 0x668(0x04)
	float RenderLightMapDensityColorScale; // 0x66c(0x04)
	struct FLinearColor LightMapDensityVertexMappedColor; // 0x670(0x10)
	struct FLinearColor LightMapDensitySelectedColor; // 0x680(0x10)
	struct TArray<struct FStatColorMapping> StatColorMappings; // 0x690(0x10)
	struct UPhysicalMaterial* DefaultPhysMaterial; // 0x6a0(0x08)
	struct FSoftObjectPath DefaultPhysMaterialName; // 0x6a8(0x18)
	struct TArray<struct FGameNameRedirect> ActiveGameNameRedirects; // 0x6c0(0x10)
	struct TArray<struct FClassRedirect> ActiveClassRedirects; // 0x6d0(0x10)
	struct TArray<struct FPluginRedirect> ActivePluginRedirects; // 0x6e0(0x10)
	struct TArray<struct FStructRedirect> ActiveStructRedirects; // 0x6f0(0x10)
	struct UTexture2D* PreIntegratedSkinBRDFTexture; // 0x700(0x08)
	struct FSoftObjectPath PreIntegratedSkinBRDFTextureName; // 0x708(0x18)
	struct UTexture2D* BlueNoiseTexture; // 0x720(0x08)
	struct FSoftObjectPath BlueNoiseTextureName; // 0x728(0x18)
	struct UTexture2D* MiniFontTexture; // 0x740(0x08)
	struct FSoftObjectPath MiniFontTextureName; // 0x748(0x18)
	struct UTexture* WeightMapPlaceholderTexture; // 0x760(0x08)
	struct FSoftObjectPath WeightMapPlaceholderTextureName; // 0x768(0x18)
	struct UTexture2D* LightMapDensityTexture; // 0x780(0x08)
	struct FSoftObjectPath LightMapDensityTextureName; // 0x788(0x18)
	char pad_7A0[0x8]; // 0x7a0(0x08)
	struct UGameViewportClient* GameViewport; // 0x7a8(0x08)
	struct TArray<struct FString> DeferredCommands; // 0x7b0(0x10)
	int32_t TickCycles; // 0x7c0(0x04)
	int32_t GameCycles; // 0x7c4(0x04)
	int32_t ClientCycles; // 0x7c8(0x04)
	float NearClipPlane; // 0x7cc(0x04)
	char bHardwareSurveyEnabled : 1; // 0x7d0(0x01)
	char bSubtitlesEnabled : 1; // 0x7d0(0x01)
	char bSubtitlesForcedOff : 1; // 0x7d0(0x01)
	char pad_7D0_3 : 5; // 0x7d0(0x01)
	char pad_7D1[0x3]; // 0x7d1(0x03)
	int32_t MaximumLoopIterationCount; // 0x7d4(0x04)
	char bCanBlueprintsTickByDefault : 1; // 0x7d8(0x01)
	char bOptimizeAnimBlueprintMemberVariableAccess : 1; // 0x7d8(0x01)
	char bAllowMultiThreadedAnimationUpdate : 1; // 0x7d8(0x01)
	char bEnableEditorPSysRealtimeLOD : 1; // 0x7d8(0x01)
	char pad_7D8_4 : 1; // 0x7d8(0x01)
	char bSmoothFrameRate : 1; // 0x7d8(0x01)
	char bUseFixedFrameRate : 1; // 0x7d8(0x01)
	char pad_7D8_7 : 1; // 0x7d8(0x01)
	char pad_7D9[0x3]; // 0x7d9(0x03)
	float FixedFrameRate; // 0x7dc(0x04)
	struct FFloatRange SmoothedFrameRateRange; // 0x7e0(0x10)
	struct UEngineCustomTimeStep* CustomTimeStep; // 0x7f0(0x08)
	char pad_7F8[0x20]; // 0x7f8(0x20)
	struct FString SkipLODStripStaticMeshNames; // 0x818(0x10)
	struct FSoftClassPath CustomTimeStepClassName; // 0x828(0x18)
	struct UTimecodeProvider* TimecodeProvider; // 0x840(0x08)
	char pad_848[0x20]; // 0x848(0x20)
	struct FSoftClassPath TimecodeProviderClassName; // 0x868(0x18)
	bool bGenerateDefaultTimecode; // 0x880(0x01)
	char pad_881[0x3]; // 0x881(0x03)
	struct FFrameRate GenerateDefaultTimecodeFrameRate; // 0x884(0x08)
	float GenerateDefaultTimecodeFrameDelay; // 0x88c(0x04)
	char bCheckForMultiplePawnsSpawnedInAFrame : 1; // 0x890(0x01)
	char pad_890_1 : 7; // 0x890(0x01)
	char pad_891[0x3]; // 0x891(0x03)
	int32_t NumPawnsAllowedToBeSpawnedInAFrame; // 0x894(0x04)
	char bShouldGenerateLowQualityLightmaps : 1; // 0x898(0x01)
	char pad_898_1 : 7; // 0x898(0x01)
	char pad_899[0x3]; // 0x899(0x03)
	struct FColor C_WorldBox; // 0x89c(0x04)
	struct FColor C_BrushWire; // 0x8a0(0x04)
	struct FColor C_AddWire; // 0x8a4(0x04)
	struct FColor C_SubtractWire; // 0x8a8(0x04)
	struct FColor C_SemiSolidWire; // 0x8ac(0x04)
	struct FColor C_NonSolidWire; // 0x8b0(0x04)
	struct FColor C_WireBackground; // 0x8b4(0x04)
	struct FColor C_ScaleBoxHi; // 0x8b8(0x04)
	struct FColor C_VolumeCollision; // 0x8bc(0x04)
	struct FColor C_BSPCollision; // 0x8c0(0x04)
	struct FColor C_OrthoBackground; // 0x8c4(0x04)
	struct FColor C_Volume; // 0x8c8(0x04)
	struct FColor C_BrushShape; // 0x8cc(0x04)
	float StreamingDistanceFactor; // 0x8d0(0x04)
	char pad_8D4[0x4]; // 0x8d4(0x04)
	struct FDirectoryPath GameScreenshotSaveDirectory; // 0x8d8(0x10)
	enum class ETransitionType TransitionType; // 0x8e8(0x01)
	char pad_8E9[0x7]; // 0x8e9(0x07)
	struct FString TransitionDescription; // 0x8f0(0x10)
	struct FString TransitionGameMode; // 0x900(0x10)
	float MeshLODRange; // 0x910(0x04)
	char bAllowMatureLanguage : 1; // 0x914(0x01)
	char pad_914_1 : 7; // 0x914(0x01)
	char pad_915[0x3]; // 0x915(0x03)
	float CameraRotationThreshold; // 0x918(0x04)
	float CameraTranslationThreshold; // 0x91c(0x04)
	float PrimitiveProbablyVisibleTime; // 0x920(0x04)
	float MaxOcclusionPixelsFraction; // 0x924(0x04)
	char bPauseOnLossOfFocus : 1; // 0x928(0x01)
	char pad_928_1 : 7; // 0x928(0x01)
	char pad_929[0x3]; // 0x929(0x03)
	int32_t MaxParticleResize; // 0x92c(0x04)
	int32_t MaxParticleResizeWarn; // 0x930(0x04)
	char pad_934[0x4]; // 0x934(0x04)
	struct TArray<struct FDropNoteInfo> PendingDroppedNotes; // 0x938(0x10)
	float NetClientTicksPerSecond; // 0x948(0x04)
	float DisplayGamma; // 0x94c(0x04)
	float MinDesiredFrameRate; // 0x950(0x04)
	struct FLinearColor DefaultSelectedMaterialColor; // 0x954(0x10)
	struct FLinearColor SelectedMaterialColor; // 0x964(0x10)
	struct FLinearColor SelectionOutlineColor; // 0x974(0x10)
	struct FLinearColor SubduedSelectionOutlineColor; // 0x984(0x10)
	struct FLinearColor SelectedMaterialColorOverride; // 0x994(0x10)
	bool bIsOverridingSelectedColor; // 0x9a4(0x01)
	char pad_9A5[0x3]; // 0x9a5(0x03)
	char bEnableOnScreenDebugMessages : 1; // 0x9a8(0x01)
	char bEnableOnScreenDebugMessagesDisplay : 1; // 0x9a8(0x01)
	char bSuppressMapWarnings : 1; // 0x9a8(0x01)
	char bDisableAILogging : 1; // 0x9a8(0x01)
	char pad_9A8_4 : 4; // 0x9a8(0x01)
	char pad_9A9[0x3]; // 0x9a9(0x03)
	uint32_t bEnableVisualLogRecordingOnStart; // 0x9ac(0x04)
	char pad_9B0[0x4]; // 0x9b0(0x04)
	int32_t ScreenSaverInhibitorSemaphore; // 0x9b4(0x04)
	char bLockReadOnlyLevels : 1; // 0x9b8(0x01)
	char pad_9B8_1 : 7; // 0x9b8(0x01)
	char pad_9B9[0x7]; // 0x9b9(0x07)
	struct FString ParticleEventManagerClassPath; // 0x9c0(0x10)
	float SelectionHighlightIntensity; // 0x9d0(0x04)
	float BSPSelectionHighlightIntensity; // 0x9d4(0x04)
	float SelectionHighlightIntensityBillboards; // 0x9d8(0x04)
	char pad_9DC[0x24c]; // 0x9dc(0x24c)
	struct TArray<struct FNetDriverDefinition> NetDriverDefinitions; // 0xc28(0x10)
	struct TArray<struct FString> ServerActors; // 0xc38(0x10)
	struct TArray<struct FString> RuntimeServerActors; // 0xc48(0x10)
	float NetErrorLogInterval; // 0xc58(0x04)
	char bStartedLoadMapMovie : 1; // 0xc5c(0x01)
	char pad_C5C_1 : 7; // 0xc5c(0x01)
	char pad_C5D[0x1b]; // 0xc5d(0x1b)
	int32_t NextWorldContextHandle; // 0xc78(0x04)
	char pad_C7C[0x194]; // 0xc7c(0x194)
};

// Class Engine.ScriptViewportClient
// Size: 0x38 (Inherited: 0x28)
struct UScriptViewportClient : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Engine.GameViewportClient
// Size: 0x330 (Inherited: 0x38)
struct UGameViewportClient : UScriptViewportClient {
	char pad_38[0x8]; // 0x38(0x08)
	struct UConsole* ViewportConsole; // 0x40(0x08)
	struct TArray<struct FDebugDisplayProperty> DebugProperties; // 0x48(0x10)
	char pad_58[0x10]; // 0x58(0x10)
	int32_t MaxSplitscreenPlayers; // 0x68(0x04)
	char pad_6C[0xc]; // 0x6c(0x0c)
	struct UWorld* World; // 0x78(0x08)
	struct UGameInstance* GameInstance; // 0x80(0x08)
	char pad_88[0x2a8]; // 0x88(0x2a8)

	void SSSwapControllers(); // Function Engine.GameViewportClient.SSSwapControllers // (Net|Exec|Native|Event|Static|NetMulticast|MulticastDelegate|Public|Private|Protected|Delegate|NetServer|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314a8200
	void ShowTitleSafeArea(); // Function Engine.GameViewportClient.ShowTitleSafeArea // (NetReliableNetRequest|Exec|Native|Event|NetResponse|Static|UbergraphFunction|Private|Protected|NetServer|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314a88c0
	void SetConsoleTarget(int32_t PlayerIndex); // Function Engine.GameViewportClient.SetConsoleTarget // (NetReliableNative|Event|UbergraphFunction|MulticastDelegate|Public|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314a88c0
};

// Class Engine.LocalPlayer
// Size: 0x258 (Inherited: 0x48)
struct ULocalPlayer : UPlayer {
	char pad_48[0x28]; // 0x48(0x28)
	struct UGameViewportClient* ViewportClient; // 0x70(0x08)
	char pad_78[0x1c]; // 0x78(0x1c)
	enum class EAspectRatioAxisConstraint AspectRatioAxisConstraint; // 0x94(0x01)
	char pad_95[0x3]; // 0x95(0x03)
	struct APlayerController* PendingLevelPlayerControllerClass; // 0x98(0x08)
	char bSentSplitJoin : 1; // 0xa0(0x01)
	char pad_A0_1 : 7; // 0xa0(0x01)
	char pad_A1[0x17]; // 0xa1(0x17)
	int32_t ControllerId; // 0xb8(0x04)
	char pad_BC[0x19c]; // 0xbc(0x19c)
};

// Class Engine.LocalPlayerSubsystem
// Size: 0x30 (Inherited: 0x30)
struct ULocalPlayerSubsystem : USubsystem {
};

// Class Engine.Brush
// Size: 0x260 (Inherited: 0x228)
struct ABrush : AActor {
	enum class EBrushType BrushType; // 0x228(0x01)
	char pad_229[0x3]; // 0x229(0x03)
	struct FColor BrushColor; // 0x22c(0x04)
	int32_t PolyFlags; // 0x230(0x04)
	char bColored : 1; // 0x234(0x01)
	char bSolidWhenSelected : 1; // 0x234(0x01)
	char bPlaceableFromClassBrowser : 1; // 0x234(0x01)
	char bNotForClientOrServer : 1; // 0x234(0x01)
	char pad_234_4 : 4; // 0x234(0x01)
	char pad_235[0x3]; // 0x235(0x03)
	struct UModel* Brush; // 0x238(0x08)
	struct UBrushComponent* BrushComponent; // 0x240(0x08)
	char bInManipulation : 1; // 0x248(0x01)
	char pad_248_1 : 7; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
	struct TArray<struct FGeomSelection> SavedSelections; // 0x250(0x10)
};

// Class Engine.Volume
// Size: 0x260 (Inherited: 0x260)
struct AVolume : ABrush {
};

// Class Engine.World
// Size: 0x860 (Inherited: 0x28)
struct UWorld : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct ULevel* PersistentLevel; // 0x30(0x08)
	struct UNetDriver* NetDriver; // 0x38(0x08)
	struct ULineBatchComponent* LineBatcher; // 0x40(0x08)
	struct ULineBatchComponent* PersistentLineBatcher; // 0x48(0x08)
	struct ULineBatchComponent* ForegroundLineBatcher; // 0x50(0x08)
	struct AGameNetworkManager* NetworkManager; // 0x58(0x08)
	struct UPhysicsCollisionHandler* PhysicsCollisionHandler; // 0x60(0x08)
	struct TArray<struct UObject*> ExtraReferencedObjects; // 0x68(0x10)
	struct TArray<struct UObject*> PerModuleDataObjects; // 0x78(0x10)
	struct TArray<struct AActor*> LevelSequenceActors; // 0x88(0x10)
	char pad_98[0x88]; // 0x98(0x88)
	struct TArray<struct ULevelStreaming*> StreamingLevels; // 0x120(0x10)
	struct FStreamingLevelsToConsider StreamingLevelsToConsider; // 0x130(0x28)
	char pad_158[0x10]; // 0x158(0x10)
	struct FString StreamingLevelsPrefix; // 0x168(0x10)
	struct ULevel* CurrentLevelPendingVisibility; // 0x178(0x08)
	struct ULevel* CurrentLevelPendingInvisibility; // 0x180(0x08)
	struct UDemoNetDriver* DemoNetDriver; // 0x188(0x08)
	struct AParticleEventManager* MyParticleEventManager; // 0x190(0x08)
	struct APhysicsVolume* DefaultPhysicsVolume; // 0x198(0x08)
	char pad_1A0[0x16]; // 0x1a0(0x16)
	char pad_1B6_0 : 2; // 0x1b6(0x01)
	char bAreConstraintsDirty : 1; // 0x1b6(0x01)
	char pad_1B6_3 : 5; // 0x1b6(0x01)
	char pad_1B7[0x1]; // 0x1b7(0x01)
	struct UNavigationSystemBase* NavigationSystem; // 0x1b8(0x08)
	struct AGameModeBase* AuthorityGameMode; // 0x1c0(0x08)
	struct AGameStateBase* GameState; // 0x1c8(0x08)
	struct UAISystemBase* AISystem; // 0x1d0(0x08)
	struct UAvoidanceManager* AvoidanceManager; // 0x1d8(0x08)
	struct TArray<struct ULevel*> Levels; // 0x1e0(0x10)
	struct TArray<struct FLevelCollection> LevelCollections; // 0x1f0(0x10)
	char pad_200[0x20]; // 0x200(0x20)
	struct UGameInstance* OwningGameInstance; // 0x220(0x08)
	struct TArray<struct UMaterialParameterCollectionInstance*> ParameterCollectionInstances; // 0x228(0x10)
	struct UCanvas* CanvasForRenderingToTarget; // 0x238(0x08)
	struct UCanvas* CanvasForDrawMaterialToRenderTarget; // 0x240(0x08)
	char pad_248[0x50]; // 0x248(0x50)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate; // 0x298(0x10)
	struct TArray<struct UActorComponent*> ComponentsThatNeedEndOfFrameUpdate_OnGameThread; // 0x2a8(0x10)
	char pad_2B8[0x3a8]; // 0x2b8(0x3a8)
	struct UWorldComposition* WorldComposition; // 0x660(0x08)
	char pad_668[0x88]; // 0x668(0x88)
	struct FWorldPSCPool PSCPool; // 0x6f0(0x58)
	char pad_748[0x118]; // 0x748(0x118)

	struct AWorldSettings* K2_GetWorldSettings(); // Function Engine.World.K2_GetWorldSettings // (Net|Event|NetMulticast|MulticastDelegate|Public|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f317afdc0
	void HandleTimelineScrubbed(); // Function Engine.World.HandleTimelineScrubbed // (Event|NetMulticast|MulticastDelegate|Public|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314c5bc0
};

// Class Engine.InterpTrack
// Size: 0x70 (Inherited: 0x28)
struct UInterpTrack : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct TArray<struct UInterpTrack*> SubTracks; // 0x38(0x10)
	struct UInterpTrackInst* TrackInstClass; // 0x48(0x08)
	enum class ETrackActiveCondition ActiveCondition; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct FString TrackTitle; // 0x58(0x10)
	char bOnePerGroup : 1; // 0x68(0x01)
	char bDirGroupOnly : 1; // 0x68(0x01)
	char bDisableTrack : 1; // 0x68(0x01)
	char bIsSelected : 1; // 0x68(0x01)
	char bIsAnimControlTrack : 1; // 0x68(0x01)
	char bSubTrackOnly : 1; // 0x68(0x01)
	char bVisible : 1; // 0x68(0x01)
	char bIsRecording : 1; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
};

// Class Engine.InterpTrackVectorBase
// Size: 0x90 (Inherited: 0x70)
struct UInterpTrackVectorBase : UInterpTrack {
	struct FInterpCurveVector VectorTrack; // 0x70(0x18)
	float CurveTension; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// Class Engine.InterpTrackFloatBase
// Size: 0x90 (Inherited: 0x70)
struct UInterpTrackFloatBase : UInterpTrack {
	struct FInterpCurveFloat FloatTrack; // 0x70(0x18)
	float CurveTension; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
};

// Class Engine.InterpTrackInst
// Size: 0x28 (Inherited: 0x28)
struct UInterpTrackInst : UObject {
};

// Class Engine.MaterialExpression
// Size: 0x40 (Inherited: 0x28)
struct UMaterialExpression : UObject {
	struct UMaterial* Material; // 0x28(0x08)
	struct UMaterialFunction* Function; // 0x30(0x08)
	char bIsParameterExpression : 1; // 0x38(0x01)
	char pad_38_1 : 7; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Engine.MaterialExpressionTextureBase
// Size: 0x50 (Inherited: 0x40)
struct UMaterialExpressionTextureBase : UMaterialExpression {
	struct UTexture* Texture; // 0x40(0x08)
	enum class EMaterialSamplerType SamplerType; // 0x48(0x01)
	char IsDefaultMeshpaintTexture : 1; // 0x49(0x01)
	char pad_49_1 : 7; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)
};

// Class Engine.MaterialExpressionTextureSample
// Size: 0xd0 (Inherited: 0x50)
struct UMaterialExpressionTextureSample : UMaterialExpressionTextureBase {
	struct FExpressionInput Coordinates; // 0x50(0x0c)
	char pad_5C[0x8]; // 0x5c(0x08)
	struct FExpressionInput TextureObject; // 0x64(0x0c)
	char pad_70[0x8]; // 0x70(0x08)
	struct FExpressionInput MipValue; // 0x78(0x0c)
	char pad_84[0x8]; // 0x84(0x08)
	struct FExpressionInput CoordinatesDX; // 0x8c(0x0c)
	char pad_98[0x8]; // 0x98(0x08)
	struct FExpressionInput CoordinatesDY; // 0xa0(0x0c)
	char pad_AC[0x8]; // 0xac(0x08)
	struct FExpressionInput AutomaticViewMipBiasValue; // 0xb4(0x0c)
	char pad_C0[0x8]; // 0xc0(0x08)
	enum class ETextureMipValueMode MipValueMode; // 0xc8(0x01)
	enum class ESamplerSourceMode SamplerSource; // 0xc9(0x01)
	char AutomaticViewMipBias : 1; // 0xca(0x01)
	char pad_CA_1 : 7; // 0xca(0x01)
	char ConstCoordinate; // 0xcb(0x01)
	int32_t ConstMipValue; // 0xcc(0x04)
};

// Class Engine.MaterialExpressionTextureSampleParameter
// Size: 0xf0 (Inherited: 0xd0)
struct UMaterialExpressionTextureSampleParameter : UMaterialExpressionTextureSample {
	struct FName ParameterName; // 0xd0(0x08)
	struct FGuid ExpressionGUID; // 0xd8(0x10)
	struct FName Group; // 0xe8(0x08)
};

// Class Engine.MaterialExpressionTextureSampleParameter2D
// Size: 0xf0 (Inherited: 0xf0)
struct UMaterialExpressionTextureSampleParameter2D : UMaterialExpressionTextureSampleParameter {
};

// Class Engine.Character
// Size: 0x4d0 (Inherited: 0x288)
struct ACharacter : APawn {
	struct USkeletalMeshComponent* Mesh; // 0x288(0x08)
	struct UCharacterMovementComponent* CharacterMovement; // 0x290(0x08)
	struct UCapsuleComponent* CapsuleComponent; // 0x298(0x08)
	struct FBasedMovementInfo BasedMovement; // 0x2a0(0x30)
	struct FBasedMovementInfo ReplicatedBasedMovement; // 0x2d0(0x30)
	float AnimRootMotionTranslationScale; // 0x300(0x04)
	struct FVector BaseTranslationOffset; // 0x304(0x0c)
	struct FQuat BaseRotationOffset; // 0x310(0x10)
	float ReplicatedServerLastTransformUpdateTimeStamp; // 0x320(0x04)
	float ReplayLastTransformUpdateTimeStamp; // 0x324(0x04)
	char ReplicatedMovementMode; // 0x328(0x01)
	bool bInBaseReplication; // 0x329(0x01)
	char pad_32A[0x2]; // 0x32a(0x02)
	float CrouchedEyeHeight; // 0x32c(0x04)
	char bIsCrouched : 1; // 0x330(0x01)
	char bProxyIsJumpForceApplied : 1; // 0x330(0x01)
	char bPressedJump : 1; // 0x330(0x01)
	char bClientUpdating : 1; // 0x330(0x01)
	char bClientWasFalling : 1; // 0x330(0x01)
	char bClientResimulateRootMotion : 1; // 0x330(0x01)
	char bClientResimulateRootMotionSources : 1; // 0x330(0x01)
	char bSimGravityDisabled : 1; // 0x330(0x01)
	char bClientCheckEncroachmentOnNetUpdate : 1; // 0x331(0x01)
	char bServerMoveIgnoreRootMotion : 1; // 0x331(0x01)
	char bWasJumping : 1; // 0x331(0x01)
	char pad_331_3 : 5; // 0x331(0x01)
	char pad_332[0x2]; // 0x332(0x02)
	float JumpKeyHoldTime; // 0x334(0x04)
	float JumpForceTimeRemaining; // 0x338(0x04)
	float ProxyJumpForceStartedTime; // 0x33c(0x04)
	float JumpMaxHoldTime; // 0x340(0x04)
	int32_t JumpMaxCount; // 0x344(0x04)
	int32_t JumpCurrentCount; // 0x348(0x04)
	char pad_34C[0x4]; // 0x34c(0x04)
	struct FMulticastInlineDelegate OnReachedJumpApex; // 0x350(0x10)
	char pad_360[0x10]; // 0x360(0x10)
	struct FMulticastInlineDelegate MovementModeChangedDelegate; // 0x370(0x10)
	struct FMulticastInlineDelegate OnCharacterMovementUpdated; // 0x380(0x10)
	struct FRootMotionSourceGroup SavedRootMotion; // 0x390(0x38)
	char pad_3C8[0x8]; // 0x3c8(0x08)
	struct FRootMotionMovementParams ClientRootMotionParams; // 0x3d0(0x40)
	struct TArray<struct FSimulatedRootMotionReplicatedMove> RootMotionRepMoves; // 0x410(0x10)
	struct FRepRootMotionMontage RepRootMotion; // 0x420(0x98)
	char pad_4B8[0x18]; // 0x4b8(0x18)

	void UnCrouch(bool bClientSimulation); // Function Engine.Character.UnCrouch // (Net|NetReliableNetRequest|Event|NetResponse|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void StopJumping(); // Function Engine.Character.StopJumping // (Native|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void StopAnimMontage(struct UAnimMontage* AnimMontage); // Function Engine.Character.StopAnimMontage // (Net|NetReliableNetRequest|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Protected|NetServer|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ServerMoveOld(float OldTimeStamp, struct FVector_NetQuantize10 OldAccel, char OldMoveFlags); // Function Engine.Character.ServerMoveOld // (Net|NetRequest|Native|NetResponse|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ServerMoveNoBase(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // Function Engine.Character.ServerMoveNoBase // (Net|NetReliableExec|NetResponse|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ServerMoveDualNoBase(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, char ClientMovementMode); // Function Engine.Character.ServerMoveDualNoBase // (NetRequest|Exec|Native|Event|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ServerMoveDualHybridRootMotion(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMoveDualHybridRootMotion // (Net|NetReliableExec|Event|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ServerMoveDual(float TimeStamp0, struct FVector_NetQuantize10 InAccel0, char PendingFlags, uint32_t View0, float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char NewFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMoveDual // (Net|Exec|Native|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ServerMove(float Timestamp, struct FVector_NetQuantize10 InAccel, struct FVector_NetQuantize100 ClientLoc, char CompressedMoveFlags, char ClientRoll, uint32_t View, struct UPrimitiveComponent* ClientMovementBase, struct FName ClientBaseBoneName, char ClientMovementMode); // Function Engine.Character.ServerMove // (Net|NetRequest|Exec|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void RootMotionDebugClientPrintOnScreen(struct FString inString); // Function Engine.Character.RootMotionDebugClientPrintOnScreen // (Net|NetReliableExec|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	float PlayAnimMontage(struct UAnimMontage* AnimMontage, float InPlayRate, struct FName StartSectionName); // Function Engine.Character.PlayAnimMontage // (NetRequest|Static|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnWalkingOffLedge(struct FVector& PreviousFloorImpactNormal, struct FVector& PreviousFloorContactNormal, struct FVector& PreviousLocation, float TimeDelta); // Function Engine.Character.OnWalkingOffLedge // (Net|NetRequest|Exec|Native|Event|NetResponse|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnRep_RootMotion(); // Function Engine.Character.OnRep_RootMotion // (Net|NetRequest|Exec|Native|Event|NetResponse|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnRep_ReplicatedBasedMovement(); // Function Engine.Character.OnRep_ReplicatedBasedMovement // (Exec|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnRep_ReplayLastTransformUpdateTimeStamp(); // Function Engine.Character.OnRep_ReplayLastTransformUpdateTimeStamp // (NetRequest|Exec|Native|Event|NetResponse|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnRep_IsCrouched(); // Function Engine.Character.OnRep_IsCrouched // (NetReliableNative|Event|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnLaunched(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.OnLaunched // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnLanded(struct FHitResult& Hit); // Function Engine.Character.OnLanded // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void OnJumped(); // Function Engine.Character.OnJumped // (Net|NetReliableExec|Event|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void LaunchCharacter(struct FVector LaunchVelocity, bool bXYOverride, bool bZOverride); // Function Engine.Character.LaunchCharacter // (Exec|Native|Event|NetResponse|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void K2_UpdateCustomMovement(float DeltaTime); // Function Engine.Character.K2_UpdateCustomMovement // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void K2_OnStartCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnStartCrouch // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void K2_OnMovementModeChanged(enum class EMovementMode PrevMovementMode, enum class EMovementMode NewMovementMode, char PrevCustomMode, char NewCustomMode); // Function Engine.Character.K2_OnMovementModeChanged // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void K2_OnEndCrouch(float HalfHeightAdjust, float ScaledHalfHeightAdjust); // Function Engine.Character.K2_OnEndCrouch // (Net|Exec|Event|NetResponse|UbergraphFunction|MulticastDelegate|NetServer|HasDefaults|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void Jump(); // Function Engine.Character.Jump // (Net|NetReliableExec|Event|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	bool IsPlayingRootMotion(); // Function Engine.Character.IsPlayingRootMotion // (Net|NetRequest|Exec|Native|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	bool IsPlayingNetworkedRootMotionMontage(); // Function Engine.Character.IsPlayingNetworkedRootMotionMontage // (NetRequest|Exec|Native|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	bool IsJumpProvidingForce(); // Function Engine.Character.IsJumpProvidingForce // (Net|NetReliableExec|Native|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	bool HasAnyRootMotion(); // Function Engine.Character.HasAnyRootMotion // (NetReliableExec|Native|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	struct UAnimMontage* GetCurrentMontage(); // Function Engine.Character.GetCurrentMontage // (Net|NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	struct FVector GetBaseTranslationOffset(); // Function Engine.Character.GetBaseTranslationOffset // (NetMulticast|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	struct FRotator GetBaseRotationOffsetRotator(); // Function Engine.Character.GetBaseRotationOffsetRotator // (Net|NetReliableNetRequest|Exec|Native|Event|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	float GetAnimRootMotionTranslationScale(); // Function Engine.Character.GetAnimRootMotionTranslationScale // (Net|NetReliableExec|Native|Event|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void Crouch(bool bClientSimulation); // Function Engine.Character.Crouch // (Net|Exec|Native|Event|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ClientVeryShortAdjustPosition(float Timestamp, struct FVector NewLoc, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientVeryShortAdjustPosition // (NetRequest|Exec|Event|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ClientCheatWalk(); // Function Engine.Character.ClientCheatWalk // (NetReliableNetRequest|Exec|Event|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ClientCheatGhost(); // Function Engine.Character.ClientCheatGhost // (NetReliableNetRequest|Exec|Event|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ClientCheatFly(); // Function Engine.Character.ClientCheatFly // (Net|Native|Event|NetResponse|NetMulticast|UbergraphFunction|Public|NetServer|HasDefaults|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ClientAdjustRootMotionSourcePosition(float Timestamp, struct FRootMotionSourceGroup ServerRootMotion, bool bHasAnimRootMotion, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionSourcePosition // (Net|Exec|Native|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f328100a0
	void ClientAdjustRootMotionPosition(float Timestamp, float ServerMontageTrackPosition, struct FVector ServerLoc, struct FVector_NetQuantizeNormal ServerRotation, float ServerVelZ, struct UPrimitiveComponent* ServerBase, struct FName ServerBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustRootMotionPosition // (NetReliableNetRequest|Exec|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ClientAdjustPosition(float Timestamp, struct FVector NewLoc, struct FVector NewVel, struct UPrimitiveComponent* NewBase, struct FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, char ServerMovementMode); // Function Engine.Character.ClientAdjustPosition // (NetRequest|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void ClientAckGoodMove(float Timestamp); // Function Engine.Character.ClientAckGoodMove // (NetReliableNetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	bool CanJumpInternal(); // Function Engine.Character.CanJumpInternal // (Net|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Public|Private|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	bool CanJump(); // Function Engine.Character.CanJump // (Net|NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	bool CanCrouch(); // Function Engine.Character.CanCrouch // (NetResponse|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
	void CacheInitialMeshOffset(struct FVector MeshRelativeLocation, struct FRotator MeshRelativeRotation); // Function Engine.Character.CacheInitialMeshOffset // (Net|NetRequest|Exec|Native|Event|Static|Private|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ca180
};

// Class Engine.SplineComponent
// Size: 0x630 (Inherited: 0x540)
struct USplineComponent : UPrimitiveComponent {
	struct FSplineCurves SplineCurves; // 0x540(0x68)
	struct FInterpCurveVector SplineInfo; // 0x5a8(0x18)
	struct FInterpCurveQuat SplineRotInfo; // 0x5c0(0x18)
	struct FInterpCurveVector SplineScaleInfo; // 0x5d8(0x18)
	struct FInterpCurveFloat SplineReparamTable; // 0x5f0(0x18)
	bool bAllowSplineEditingPerInstance; // 0x608(0x01)
	char pad_609[0x3]; // 0x609(0x03)
	int32_t ReparamStepsPerSegment; // 0x60c(0x04)
	float Duration; // 0x610(0x04)
	bool bStationaryEndpoints; // 0x614(0x01)
	bool bSplineHasBeenEdited; // 0x615(0x01)
	bool bModifiedByConstructionScript; // 0x616(0x01)
	bool bInputSplinePointsToConstructionScript; // 0x617(0x01)
	bool bDrawDebug; // 0x618(0x01)
	bool bClosedLoop; // 0x619(0x01)
	bool bLoopPositionOverride; // 0x61a(0x01)
	char pad_61B[0x1]; // 0x61b(0x01)
	float LoopPosition; // 0x61c(0x04)
	struct FVector DefaultUpVector; // 0x620(0x0c)
	char pad_62C[0x4]; // 0x62c(0x04)

	void UpdateSpline(); // Function Engine.SplineComponent.UpdateSpline // (Net|NetRequest|Public|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d49c0
	void SetWorldLocationAtSplinePoint(int32_t PointIndex, struct FVector& InLocation); // Function Engine.SplineComponent.SetWorldLocationAtSplinePoint // (Net|NetReliableNative|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetUpVectorAtSplinePoint(int32_t PointIndex, struct FVector& InUpVector, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetUpVectorAtSplinePoint // (Net|NetRequest|Exec|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetUnselectedSplineSegmentColor(struct FLinearColor& SegmentColor); // Function Engine.SplineComponent.SetUnselectedSplineSegmentColor // (NetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Private|Protected|Delegate|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetTangentsAtSplinePoint(int32_t PointIndex, struct FVector& InArriveTangent, struct FVector& InLeaveTangent, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentsAtSplinePoint // (NetReliableNetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetTangentAtSplinePoint(int32_t PointIndex, struct FVector& InTangent, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetTangentAtSplinePoint // (Net|Event|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetSplineWorldPoints(struct TArray<struct FVector>& Points); // Function Engine.SplineComponent.SetSplineWorldPoints // (Net|NetReliableExec|Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetSplinePointType(int32_t PointIndex, enum class ESplinePointType Type, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePointType // (NetReliableNative|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetSplinePoints(struct TArray<struct FVector>& Points, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetSplinePoints // (NetReliableNetRequest|Native|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetSplineLocalPoints(struct TArray<struct FVector>& Points); // Function Engine.SplineComponent.SetSplineLocalPoints // (Net|NetReliableNetRequest|Exec|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetSelectedSplineSegmentColor(struct FLinearColor& SegmentColor); // Function Engine.SplineComponent.SetSelectedSplineSegmentColor // (NetRequest|Event|NetResponse|Static|NetMulticast|UbergraphFunction|Public|Private|Protected|Delegate|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetLocationAtSplinePoint(int32_t PointIndex, struct FVector& InLocation, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.SetLocationAtSplinePoint // (Net|NetReliableNetRequest|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetDrawDebug(bool bShow); // Function Engine.SplineComponent.SetDrawDebug // (NetRequest|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetDefaultUpVector(struct FVector& UpVector, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.SetDefaultUpVector // (Net|NetResponse|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetClosedLoopAtPosition(bool bInClosedLoop, float Key, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoopAtPosition // (Net|NetRequest|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void SetClosedLoop(bool bInClosedLoop, bool bUpdateSpline); // Function Engine.SplineComponent.SetClosedLoop // (Net|Exec|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void RemoveSplinePoint(int32_t Index, bool bUpdateSpline); // Function Engine.SplineComponent.RemoveSplinePoint // (NetReliableNetRequest|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	bool IsClosedLoop(); // Function Engine.SplineComponent.IsClosedLoop // (NetReliableNetRequest|Native|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetWorldTangentAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldTangentAtDistanceAlongSpline // (Net|NetReliableNative|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FRotator GetWorldRotationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldRotationAtTime // (Net|NetReliableNetRequest|Exec|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FRotator GetWorldRotationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldRotationAtDistanceAlongSpline // (NetRequest|Exec|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetWorldLocationAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldLocationAtTime // (Net|Exec|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetWorldLocationAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetWorldLocationAtSplinePoint // (NetReliableNetRequest|Event|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetWorldLocationAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldLocationAtDistanceAlongSpline // (Net|NetReliableEvent|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetWorldDirectionAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetWorldDirectionAtTime // (Net|NetReliableNetRequest|Exec|Native|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetWorldDirectionAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetWorldDirectionAtDistanceAlongSpline // (Net|NetRequest|Exec|Native|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetVectorPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplinePoint // (Net|Exec|Native|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetVectorPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetVectorPropertyAtSplineInputKey // (NetReliableNetRequest|Native|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetUpVectorAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetUpVectorAtTime // (Net|Native|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetUpVectorAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplinePoint // (NetReliableNetRequest|Exec|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetUpVectorAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtSplineInputKey // (Net|NetReliableExec|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetUpVectorAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetUpVectorAtDistanceAlongSpline // (Net|NetReliableNetRequest|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FTransform GetTransformAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtTime // (Net|Static|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FTransform GetTransformAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplinePoint // (NetRequest|Exec|Native|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FTransform GetTransformAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtSplineInputKey // (Net|NetReliableNetRequest|Native|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FTransform GetTransformAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.GetTransformAtDistanceAlongSpline // (Net|Native|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetTangentAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetTangentAtTime // (Net|NetRequest|Exec|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplinePoint // (NetRequest|Exec|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetTangentAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtSplineInputKey // (Net|Exec|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetTangentAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetTangentAtDistanceAlongSpline // (NetReliableNetRequest|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	enum class ESplinePointType GetSplinePointType(int32_t PointIndex); // Function Engine.SplineComponent.GetSplinePointType // (NetRequest|Event|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetSplineLength(); // Function Engine.SplineComponent.GetSplineLength // (Net|NetReliableEvent|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetScaleAtTime(float Time, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetScaleAtTime // (Net|NetRequest|Exec|Native|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetScaleAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetScaleAtSplinePoint // (Net|NetReliableExec|Native|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetScaleAtSplineInputKey(float InKey); // Function Engine.SplineComponent.GetScaleAtSplineInputKey // (Exec|Native|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetScaleAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetScaleAtDistanceAlongSpline // (NetReliableNetRequest|Native|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FRotator GetRotationAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRotationAtTime // (Net|Native|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FRotator GetRotationAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplinePoint // (NetReliableNetRequest|Exec|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FRotator GetRotationAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtSplineInputKey // (NetReliableExec|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FRotator GetRotationAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRotationAtDistanceAlongSpline // (Net|NetReliableNetRequest|NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetRollAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRollAtTime // (Net|NetReliableNetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetRollAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplinePoint // (NetResponse|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetRollAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtSplineInputKey // (NetRequest|Exec|Native|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetRollAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRollAtDistanceAlongSpline // (Net|Exec|Native|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetRightVectorAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetRightVectorAtTime // (Net|NetRequest|Native|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetRightVectorAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplinePoint // (Net|Native|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetRightVectorAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtSplineInputKey // (NetReliableNetRequest|Exec|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetRightVectorAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetRightVectorAtDistanceAlongSpline // (NetReliableExec|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	int32_t GetNumberOfSplineSegments(); // Function Engine.SplineComponent.GetNumberOfSplineSegments // (NetReliableExec|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	int32_t GetNumberOfSplinePoints(); // Function Engine.SplineComponent.GetNumberOfSplinePoints // (Net|Exec|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetLocationAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetLocationAtTime // (NetRequest|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetLocationAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplinePoint // (Net|Event|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetLocationAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtSplineInputKey // (NetReliableNetRequest|Exec|Native|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetLocationAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAtDistanceAlongSpline // (NetReliableExec|Native|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void GetLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector& Location, struct FVector& Tangent, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLocationAndTangentAtSplinePoint // (NetRequest|Native|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void GetLocalLocationAndTangentAtSplinePoint(int32_t PointIndex, struct FVector& LocalLocation, struct FVector& LocalTangent); // Function Engine.SplineComponent.GetLocalLocationAndTangentAtSplinePoint // (Native|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetLeaveTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetLeaveTangentAtSplinePoint // (NetRequest|Exec|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetInputKeyAtDistanceAlongSpline(float Distance); // Function Engine.SplineComponent.GetInputKeyAtDistanceAlongSpline // (NetReliableExec|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetFloatPropertyAtSplinePoint(int32_t Index, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplinePoint // (Net|NetReliableNetRequest|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetFloatPropertyAtSplineInputKey(float InKey, struct FName PropertyName); // Function Engine.SplineComponent.GetFloatPropertyAtSplineInputKey // (NetRequest|NetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float GetDistanceAlongSplineAtSplinePoint(int32_t PointIndex); // Function Engine.SplineComponent.GetDistanceAlongSplineAtSplinePoint // (NetReliableNetMulticast|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetDirectionAtTime(float Time, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseConstantVelocity); // Function Engine.SplineComponent.GetDirectionAtTime // (Net|NetRequest|Exec|Native|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetDirectionAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplinePoint // (NetReliableExec|Native|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetDirectionAtSplineInputKey(float InKey, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtSplineInputKey // (NetReliableNetRequest|Native|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetDirectionAtDistanceAlongSpline(float Distance, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDirectionAtDistanceAlongSpline // (Net|NetReliableNative|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetDefaultUpVector(enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetDefaultUpVector // (Native|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector GetArriveTangentAtSplinePoint(int32_t PointIndex, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.GetArriveTangentAtSplinePoint // (Net|NetRequest|Exec|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector FindUpVectorClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindUpVectorClosestToWorldLocation // (Net|Exec|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FTransform FindTransformClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace, bool bUseScale); // Function Engine.SplineComponent.FindTransformClosestToWorldLocation // (NetRequest|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector FindTangentClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindTangentClosestToWorldLocation // (Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector FindScaleClosestToWorldLocation(struct FVector& WorldLocation); // Function Engine.SplineComponent.FindScaleClosestToWorldLocation // (NetReliableNetRequest|Exec|Native|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FRotator FindRotationClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRotationClosestToWorldLocation // (NetReliableExec|Native|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float FindRollClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRollClosestToWorldLocation // (NetReliableNetRequest|Native|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector FindRightVectorClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindRightVectorClosestToWorldLocation // (Net|NetReliableNative|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector FindLocationClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindLocationClosestToWorldLocation // (Net|NetReliableNetRequest|Exec|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	float FindInputKeyClosestToWorldLocation(struct FVector& WorldLocation); // Function Engine.SplineComponent.FindInputKeyClosestToWorldLocation // (NetRequest|Exec|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	struct FVector FindDirectionClosestToWorldLocation(struct FVector& WorldLocation, enum class ESplineCoordinateSpace CoordinateSpace); // Function Engine.SplineComponent.FindDirectionClosestToWorldLocation // (Net|Exec|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void ClearSplinePoints(bool bUpdateSpline); // Function Engine.SplineComponent.ClearSplinePoints // (NetReliableNetRequest|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void AddSplineWorldPoint(struct FVector& Position); // Function Engine.SplineComponent.AddSplineWorldPoint // (NetRequest|NetResponse|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void AddSplinePointAtIndex(struct FVector& Position, int32_t Index, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePointAtIndex // (NetReliableNetRequest|Exec|Native|Event|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void AddSplinePoint(struct FVector& Position, enum class ESplineCoordinateSpace CoordinateSpace, bool bUpdateSpline); // Function Engine.SplineComponent.AddSplinePoint // (NetReliableExec|Native|Event|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void AddSplineLocalPoint(struct FVector& Position); // Function Engine.SplineComponent.AddSplineLocalPoint // (Exec|Native|Event|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void AddPoints(struct TArray<struct FSplinePoint>& Points, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoints // (NetRequest|Native|Event|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
	void AddPoint(struct FSplinePoint& Point, bool bUpdateSpline); // Function Engine.SplineComponent.AddPoint // (Native|Event|Static|UbergraphFunction|MulticastDelegate|Private|Protected|NetServer|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314ce740
};

// Class Engine.AnimBoneCompressionCodec
// Size: 0x38 (Inherited: 0x28)
struct UAnimBoneCompressionCodec : UObject {
	struct FString Description; // 0x28(0x10)
};

// Class Engine.AnimCurveCompressionCodec
// Size: 0x28 (Inherited: 0x28)
struct UAnimCurveCompressionCodec : UObject {
};

// Class Engine.Commandlet
// Size: 0x80 (Inherited: 0x28)
struct UCommandlet : UObject {
	struct FString HelpDescription; // 0x28(0x10)
	struct FString HelpUsage; // 0x38(0x10)
	struct FString HelpWebLink; // 0x48(0x10)
	struct TArray<struct FString> HelpParamNames; // 0x58(0x10)
	struct TArray<struct FString> HelpParamDescriptions; // 0x68(0x10)
	char IsServer : 1; // 0x78(0x01)
	char IsClient : 1; // 0x78(0x01)
	char IsEditor : 1; // 0x78(0x01)
	char LogToConsole : 1; // 0x78(0x01)
	char ShowErrorCount : 1; // 0x78(0x01)
	char ShowProgress : 1; // 0x78(0x01)
	char pad_78_6 : 2; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Engine.AnimInstance
// Size: 0x270 (Inherited: 0x28)
struct UAnimInstance : UObject {
	struct USkeleton* CurrentSkeleton; // 0x28(0x08)
	enum class ERootMotionMode RootMotionMode; // 0x30(0x01)
	char bUseMultiThreadedAnimationUpdate : 1; // 0x31(0x01)
	char bUsingCopyPoseFromMesh : 1; // 0x31(0x01)
	char pad_31_2 : 2; // 0x31(0x01)
	char bReceiveNotifiesFromLinkedInstances : 1; // 0x31(0x01)
	char bPropagateNotifiesToLinkedInstances : 1; // 0x31(0x01)
	char bQueueMontageEvents : 1; // 0x31(0x01)
	char pad_31_7 : 1; // 0x31(0x01)
	char pad_32[0x6]; // 0x32(0x06)
	struct FMulticastInlineDelegate OnMontageBlendingOut; // 0x38(0x10)
	struct FMulticastInlineDelegate OnMontageStarted; // 0x48(0x10)
	struct FMulticastInlineDelegate OnMontageEnded; // 0x58(0x10)
	struct FMulticastInlineDelegate OnAllMontageInstancesEnded; // 0x68(0x10)
	char pad_78[0x88]; // 0x78(0x88)
	struct FAnimNotifyQueue NotifyQueue; // 0x100(0x70)
	struct TArray<struct FAnimNotifyEvent> ActiveAnimNotifyState; // 0x170(0x10)
	char pad_180[0xf0]; // 0x180(0xf0)

	void UnlockAIResources(bool bUnlockMovement, bool UnlockAILogic); // Function Engine.AnimInstance.UnlockAIResources // (Exec|Native|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8f80
	void UnlinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.AnimInstance.UnlinkAnimClassLayers // (NetReliableNetRequest|Exec|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	struct APawn* TryGetPawnOwner(); // Function Engine.AnimInstance.TryGetPawnOwner // (Net|NetRequest|Exec|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void StopSlotAnimation(float InBlendOutTime, struct FName SlotNodeName); // Function Engine.AnimInstance.StopSlotAnimation // (NetReliableExec|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void SnapshotPose(struct FPoseSnapshot& Snapshot); // Function Engine.AnimInstance.SnapshotPose // (NetReliableNetRequest|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void SetRootMotionMode(enum class ERootMotionMode Value); // Function Engine.AnimInstance.SetRootMotionMode // (Net|NetReliableExec|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void SetReceiveNotifiesFromLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetReceiveNotifiesFromLinkedInstances // (NetRequest|Event|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void SetPropagateNotifiesToLinkedInstances(bool bSet); // Function Engine.AnimInstance.SetPropagateNotifiesToLinkedInstances // (NetReliableEvent|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void SetMorphTarget(struct FName MorphTargetName, float Value); // Function Engine.AnimInstance.SetMorphTarget // (Net|NetReliableNetRequest|Exec|Native|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void SavePoseSnapshot(struct FName SnapshotName); // Function Engine.AnimInstance.SavePoseSnapshot // (NetReliableNetRequest|NetResponse|Static|UbergraphFunction|Private|Protected|NetServer|HasOutParms|NetClient|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void ResetDynamics(enum class ETeleportType InTeleportType); // Function Engine.AnimInstance.ResetDynamics // (Net|NetRequest|Exec|Native|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	struct UAnimMontage* PlaySlotAnimationAsDynamicMontage(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount, float BlendOutTriggerTime, float InTimeToStartMontageAt); // Function Engine.AnimInstance.PlaySlotAnimationAsDynamicMontage // (NetRequest|Native|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	float PlaySlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName, float BlendInTime, float BlendOutTime, float InPlayRate, int32_t LoopCount); // Function Engine.AnimInstance.PlaySlotAnimation // (Net|NetRequest|Exec|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_StopGroupByName(float InBlendOutTime, struct FName GroupName); // Function Engine.AnimInstance.Montage_StopGroupByName // (Net|Exec|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_Stop(float InBlendOutTime, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Stop // (NetReliableNetRequest|NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_SetPosition(struct UAnimMontage* Montage, float NewPosition); // Function Engine.AnimInstance.Montage_SetPosition // (Net|NetReliableNetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_SetPlayRate(struct UAnimMontage* Montage, float NewPlayRate); // Function Engine.AnimInstance.Montage_SetPlayRate // (NetResponse|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_SetNextSection(struct FName SectionNameToChange, struct FName NextSection, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_SetNextSection // (NetRequest|Exec|Native|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_Resume(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Resume // (NetReliableExec|Native|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	float Montage_Play(struct UAnimMontage* MontageToPlay, float InPlayRate, enum class EMontagePlayReturnType ReturnValueType, float InTimeToStartMontageAt, bool bStopAllMontages); // Function Engine.AnimInstance.Montage_Play // (Net|NetReliableNative|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_Pause(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_Pause // (Net|Native|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_JumpToSectionsEnd(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSectionsEnd // (NetReliableNetRequest|Exec|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void Montage_JumpToSection(struct FName SectionName, struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_JumpToSection // (Net|NetReliableExec|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	bool Montage_IsPlaying(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsPlaying // (Net|Exec|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	bool Montage_IsActive(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_IsActive // (Net|NetReliableNetRequest|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	float Montage_GetPosition(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPosition // (NetRequest|Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	float Montage_GetPlayRate(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetPlayRate // (NetReliableEvent|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	bool Montage_GetIsStopped(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetIsStopped // (Event|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	struct FName Montage_GetCurrentSection(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetCurrentSection // (Net|NetRequest|Exec|Native|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	float Montage_GetBlendTime(struct UAnimMontage* Montage); // Function Engine.AnimInstance.Montage_GetBlendTime // (Net|NetReliableExec|Native|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void LockAIResources(bool bLockMovement, bool LockAILogic); // Function Engine.AnimInstance.LockAIResources // (Exec|Native|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void LinkAnimGraphByTag(struct FName InTag, struct UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimGraphByTag // (Net|NetRequest|Native|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	void LinkAnimClassLayers(struct UAnimInstance* InClass); // Function Engine.AnimInstance.LinkAnimClassLayers // (Net|NetReliableNative|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	bool IsSyncGroupBetweenMarkers(struct FName InSyncGroupName, struct FName PreviousMarker, struct FName NextMarker, bool bRespectMarkerOrder); // Function Engine.AnimInstance.IsSyncGroupBetweenMarkers // (Net|NetRequest|Exec|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	bool IsPlayingSlotAnimation(struct UAnimSequenceBase* Asset, struct FName SlotNodeName); // Function Engine.AnimInstance.IsPlayingSlotAnimation // (NetReliableExec|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
	bool IsAnyMontagePlaying(); // Function Engine.AnimInstance.IsAnyMontagePlaying // (NetReliableExec|Static|UbergraphFunction|MulticastDelegate|Protected|Delegate|NetClient|DLLImport|BlueprintCallable|BlueprintEvent|NetValidate) // @ game+0xffff822f314d8d40
